zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_ESPI.h
/*
** ###################################################################
**     Processors:          MCXA286VASR
**                          MCXA286VLL
**                          MCXA286VLQ
**                          MCXA286VPN
**                          MCXA287VASR
**                          MCXA287VLL
**                          MCXA287VLQ
**                          MCXA287VPN
**                          MCXA456VASR
**                          MCXA456VLL
**                          MCXA456VLQ
**                          MCXA456VPN
**                          MCXA457VASR
**                          MCXA457VLL
**                          MCXA457VLQ
**                          MCXA457VPN
**                          MCXA536VLL
**                          MCXA536VLQ
**                          MCXA536VPN
**                          MCXA537VLL
**                          MCXA537VLQ
**                          MCXA537VPN
**                          MCXA556BVPN
**                          MCXA556VPN
**                          MCXA557BVPN
**                          MCXA557VPN
**                          MCXA566VLL
**                          MCXA566VLQ
**                          MCXA566VPN
**                          MCXA567VLL
**                          MCXA567VLQ
**                          MCXA567VPN
**                          MCXA577VLL
**                          MCXA577VLQ
**                          MCXA577VPN
**
**     Version:             rev. 2.0, 2024-10-29
**     Build:               b260708
**
**     Abstract:
**         CMSIS Peripheral Access Layer for ESPI
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2024-03-26)
**         Initial version based on Rev1 DraftC RM
**     - rev. 2.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_ESPI.h
 * @version 2.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for ESPI
 *
 * CMSIS Peripheral Access Layer for ESPI
 */

#if !defined(PERI_ESPI_H_)
#define PERI_ESPI_H_                             /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXA286VASR) || defined(CPU_MCXA286VLL) || defined(CPU_MCXA286VLQ) || defined(CPU_MCXA286VPN))
#include "MCXA286_COMMON.h"
#elif (defined(CPU_MCXA287VASR) || defined(CPU_MCXA287VLL) || defined(CPU_MCXA287VLQ) || defined(CPU_MCXA287VPN))
#include "MCXA287_COMMON.h"
#elif (defined(CPU_MCXA456VASR) || defined(CPU_MCXA456VLL) || defined(CPU_MCXA456VLQ) || defined(CPU_MCXA456VPN))
#include "MCXA456_COMMON.h"
#elif (defined(CPU_MCXA457VASR) || defined(CPU_MCXA457VLL) || defined(CPU_MCXA457VLQ) || defined(CPU_MCXA457VPN))
#include "MCXA457_COMMON.h"
#elif (defined(CPU_MCXA536VLL) || defined(CPU_MCXA536VLQ) || defined(CPU_MCXA536VPN))
#include "MCXA536_COMMON.h"
#elif (defined(CPU_MCXA537VLL) || defined(CPU_MCXA537VLQ) || defined(CPU_MCXA537VPN))
#include "MCXA537_COMMON.h"
#elif (defined(CPU_MCXA556BVPN) || defined(CPU_MCXA556VPN))
#include "MCXA556_COMMON.h"
#elif (defined(CPU_MCXA557BVPN) || defined(CPU_MCXA557VPN))
#include "MCXA557_COMMON.h"
#elif (defined(CPU_MCXA566VLL) || defined(CPU_MCXA566VLQ) || defined(CPU_MCXA566VPN))
#include "MCXA566_COMMON.h"
#elif (defined(CPU_MCXA567VLL) || defined(CPU_MCXA567VLQ) || defined(CPU_MCXA567VPN))
#include "MCXA567_COMMON.h"
#elif (defined(CPU_MCXA577VLL) || defined(CPU_MCXA577VLQ) || defined(CPU_MCXA577VPN))
#include "MCXA577_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- ESPI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ESPI_Peripheral_Access_Layer ESPI Peripheral Access Layer
 * @{
 */

/** ESPI - Size of Registers Arrays */
#define ESPI_PORT_COUNT                           5u

/** ESPI - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCTRL;                             /**< Master Control, offset: 0x0 */
  __IO uint32_t MSTAT;                             /**< Master Status, offset: 0x4 */
  __IO uint32_t INTENSET;                          /**< Interrupt Enable Set, offset: 0x8 */
  __IO uint32_t INTENCLR;                          /**< Interrupt Clear, offset: 0xC */
  __IO uint32_t INTSTAT;                           /**< Masked Interrupt Status, offset: 0x10 */
  __IO uint32_t DMACTRL;                           /**< DMA Control, offset: 0x14 */
  __IO uint32_t RAMBASE;                           /**< RAM Base, offset: 0x18 */
  __IO uint32_t MAPBASE;                           /**< Mapped Base, offset: 0x1C */
  __IO uint32_t IRQPUSH;                           /**< IRQ Push, offset: 0x20 */
  __IO uint32_t WIREWO;                            /**< Virtual Wire MCU-to-host, offset: 0x24 */
  __I  uint32_t WIRERO;                            /**< Virtual Wire Host-to-MCU, offset: 0x28 */
       uint8_t RESERVED_0[4];
  __IO uint32_t P80STAT;                           /**< Port 80 Status, offset: 0x30 */
  __IO uint32_t STATADDR;                          /**< Status Block Address, offset: 0x34 */
       uint8_t RESERVED_1[8];
  __IO uint32_t ESPICAP;                           /**< eSPI Capabilities, offset: 0x40 */
  __I  uint32_t ESPICFG;                           /**< eSPI Configuration, offset: 0x44 */
  __IO uint32_t ESPIMISC;                          /**< eSPI Miscellaneous, offset: 0x48 */
       uint8_t RESERVED_2[4];
  __IO uint32_t RPMC_SUPPORT1;                     /**< RPMC Support 1, offset: 0x50 */
  __IO uint32_t RPMC_SUPPORT2;                     /**< RPMC Support 2, offset: 0x54 */
  __I  uint32_t WIREIN_GPIO;                       /**< WIREIN_GPIO, offset: 0x58 */
  __I  uint32_t WIREOUT_GPIO;                      /**< WIREOUT_GPIO, offset: 0x5C */
       uint8_t RESERVED_3[160];
  struct {                                         /* offset: 0x100, array step: 0x20 */
    __IO uint32_t CFG;                               /**< Port Configuration, array offset: 0x100, array step: 0x20 */
    __IO uint32_t STAT;                              /**< Port Status, array offset: 0x104, array step: 0x20 */
    __IO uint32_t IRULESTAT;                         /**< Set Interrupt Rules and User Status, array offset: 0x108, array step: 0x20 */
    union {                                          /* offset: 0x10C, array step: 0x20 */
      __IO uint32_t ADDR;                              /**< Port Address, array offset: 0x10C, array step: 0x20 */
      __IO uint32_t OMFLEN;                            /**< Port OOB, Mastering, and Flash Length, array offset: 0x10C, array step: 0x20 */
    };
    __I  uint32_t DATAIN;                            /**< Port Data Input, array offset: 0x110, array step: 0x20 */
    union {                                          /* offset: 0x114, array step: 0x20 */
      __IO uint32_t DATAOUT;                           /**< Port Data Out, array offset: 0x114, array step: 0x20 */
      __IO uint32_t RAMUSE;                            /**< Port RAM Use, array offset: 0x114, array step: 0x20 */
    };
         uint8_t RESERVED_0[8];
  } PORT[ESPI_PORT_COUNT];
} ESPI_Type;

/* ----------------------------------------------------------------------------
   -- ESPI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ESPI_Register_Masks ESPI Register Masks
 * @{
 */

/*! @name MCTRL - Master Control */
/*! @{ */

#define ESPI_MCTRL_ENABLE_MASK                   (0x3U)
#define ESPI_MCTRL_ENABLE_SHIFT                  (0U)
/*! ENABLE - Enable
 *  0b00..Disabled. Block is not operational.
 *  0b01..eSPI (Enhanced Serial Peripheral Interface)
 *  0b10..LPC (Low Pin Count)
 *  0b11..Reserved
 */
#define ESPI_MCTRL_ENABLE(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_MCTRL_ENABLE_SHIFT)) & ESPI_MCTRL_ENABLE_MASK)

