zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_ESPI.h
#define ESPI_MCTRL_RTC_INT_BMC_MASK              (0x4U)
#define ESPI_MCTRL_RTC_INT_BMC_SHIFT             (2U)
/*! RTC_INT_BMC - RTC-Integrated-BMC
 *  0b0..BMC does not support an integrated RTC.
 *  0b1..BMC supports an integrated RTC to which eSPI controller can forward RTC targeting IO cycles. (**ESPI slave regs: 0x8, bit 29**).
 */
#define ESPI_MCTRL_RTC_INT_BMC(x)                (((uint32_t)(((uint32_t)(x)) << ESPI_MCTRL_RTC_INT_BMC_SHIFT)) & ESPI_MCTRL_RTC_INT_BMC_MASK)

#define ESPI_MCTRL_PENA_MASK                     (0x1F00U)
#define ESPI_MCTRL_PENA_SHIFT                    (8U)
/*! PENA - Port Enable */
#define ESPI_MCTRL_PENA(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_MCTRL_PENA_SHIFT)) & ESPI_MCTRL_PENA_MASK)

#define ESPI_MCTRL_P80ENA_MASK                   (0x10000U)
#define ESPI_MCTRL_P80ENA_SHIFT                  (16U)
/*! P80ENA - Port 80 Enable */
#define ESPI_MCTRL_P80ENA(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_MCTRL_P80ENA_SHIFT)) & ESPI_MCTRL_P80ENA_MASK)

#define ESPI_MCTRL_SBLKENA_MASK                  (0x20000U)
#define ESPI_MCTRL_SBLKENA_SHIFT                 (17U)
/*! SBLKENA - Status Block Enable */
#define ESPI_MCTRL_SBLKENA(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_MCTRL_SBLKENA_SHIFT)) & ESPI_MCTRL_SBLKENA_MASK)

#define ESPI_MCTRL_CLK_DIV_DISABLE_MASK          (0x40000U)
#define ESPI_MCTRL_CLK_DIV_DISABLE_SHIFT         (18U)
/*! CLK_DIV_DISABLE - Clock Division Disable
 *  0b0..Clock division is enabled.
 *  0b1..Clock division is disabled.
 */
#define ESPI_MCTRL_CLK_DIV_DISABLE(x)            (((uint32_t)(((uint32_t)(x)) << ESPI_MCTRL_CLK_DIV_DISABLE_SHIFT)) & ESPI_MCTRL_CLK_DIV_DISABLE_MASK)

#define ESPI_MCTRL_EARLY_SAMPLE_MASK             (0x80000U)
#define ESPI_MCTRL_EARLY_SAMPLE_SHIFT            (19U)
/*! EARLY_SAMPLE - Early Sample */
#define ESPI_MCTRL_EARLY_SAMPLE(x)               (((uint32_t)(((uint32_t)(x)) << ESPI_MCTRL_EARLY_SAMPLE_SHIFT)) & ESPI_MCTRL_EARLY_SAMPLE_MASK)
/*! @} */

/*! @name MSTAT - Master Status */
/*! @{ */

#define ESPI_MSTAT_PORTINT_MASK                  (0x1FU)
#define ESPI_MSTAT_PORTINT_SHIFT                 (0U)
/*! PORTINT - Port Interrupt */
#define ESPI_MSTAT_PORTINT(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_PORTINT_SHIFT)) & ESPI_MSTAT_PORTINT_MASK)

#define ESPI_MSTAT_P80INT_MASK                   (0x100U)
#define ESPI_MSTAT_P80INT_SHIFT                  (8U)
/*! P80INT - Port80 Interrupt Request */
#define ESPI_MSTAT_P80INT(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_P80INT_SHIFT)) & ESPI_MSTAT_P80INT_MASK)

#define ESPI_MSTAT_BUSRST_MASK                   (0x200U)
#define ESPI_MSTAT_BUSRST_SHIFT                  (9U)
/*! BUSRST - Bus Reset
 *  0b0..Reserved
 *  0b1..The bit entered or exited reset. Sticky, must clear.
 */
#define ESPI_MSTAT_BUSRST(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_BUSRST_SHIFT)) & ESPI_MSTAT_BUSRST_MASK)

#define ESPI_MSTAT_IRQUPD_MASK                   (0x400U)
#define ESPI_MSTAT_IRQUPD_SHIFT                  (10U)
/*! IRQUPD - Interrupt Request Update Completion
 *  0b0..Reserved
 *  0b1..The bus had an IRQ update completion (for eSPI, IRQPush done; for LPC, SERIRQ done). Sticky, must clear.
 */
#define ESPI_MSTAT_IRQUPD(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_IRQUPD_SHIFT)) & ESPI_MSTAT_IRQUPD_MASK)

#define ESPI_MSTAT_WIRECHG_MASK                  (0x800U)
#define ESPI_MSTAT_WIRECHG_SHIFT                 (11U)
/*! WIRECHG - Wire Change
 *  0b0..Reserved
 *  0b1..For eSPI, one or more input VWires have changed since last cleared for eSPI. For LPC, SERIRQ started. Sticky, write to clear.
 */
#define ESPI_MSTAT_WIRECHG(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_WIRECHG_SHIFT)) & ESPI_MSTAT_WIRECHG_MASK)

#define ESPI_MSTAT_HSTALL_MASK                   (0x1000U)
#define ESPI_MSTAT_HSTALL_SHIFT                  (12U)
/*! HSTALL - Host Stall
 *  0b0..Reserved
 *  0b1..Host is stalled on a read from or write to a port that has the STALLRD or STALLWR bit set in the PnCFG
 *       register. The application must write 1 to this bit to clear and release the host. The stall should not
 *       allowed to persist.
 */
#define ESPI_MSTAT_HSTALL(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_HSTALL_SHIFT)) & ESPI_MSTAT_HSTALL_MASK)

#define ESPI_MSTAT_CRCERR_MASK                   (0x2000U)
#define ESPI_MSTAT_CRCERR_SHIFT                  (13U)
/*! CRCERR - Cyclic Redundancy Check (CRC) Error
 *  0b0..Reserved
 *  0b1..CRC from the master did not match the computed CRC. The state of the app may be in error (due to bad data). Write 1 to clear.
 */
#define ESPI_MSTAT_CRCERR(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_CRCERR_SHIFT)) & ESPI_MSTAT_CRCERR_MASK)

#define ESPI_MSTAT_GPIO_MASK                     (0x4000U)
#define ESPI_MSTAT_GPIO_SHIFT                    (14U)
/*! GPIO - General Purpose Input/Output (GPIO)
 *  0b0..Reserved
 *  0b1..ESPIMISC[GPIO] has had an input change. Only detected if INTENSET has configured this bit to interrupt. Write 1 to clear.
 */
#define ESPI_MSTAT_GPIO(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_GPIO_SHIFT)) & ESPI_MSTAT_GPIO_MASK)

#define ESPI_MSTAT_BUSY_MASK                     (0x10000U)
#define ESPI_MSTAT_BUSY_SHIFT                    (16U)
/*! BUSY - Bus Busy
 *  0b0..Idle
 *  0b1..Busy
 */
#define ESPI_MSTAT_BUSY(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_BUSY_SHIFT)) & ESPI_MSTAT_BUSY_MASK)

#define ESPI_MSTAT_INRST_MASK                    (0x20000U)
#define ESPI_MSTAT_INRST_SHIFT                   (17U)
/*! INRST - Bus Reset
 *  0b0..Bus not in reset
 *  0b1..Bus is in reset
 */
#define ESPI_MSTAT_INRST(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_INRST_SHIFT)) & ESPI_MSTAT_INRST_MASK)

#define ESPI_MSTAT_COMPPEND_MASK                 (0x40000U)
#define ESPI_MSTAT_COMPPEND_SHIFT                (18U)
/*! COMPPEND - Completion Pending
 *  0b0..No completions pending
 *  0b1..Completions are pending for eSPI. Indicates quiet mode for LPC
 */
#define ESPI_MSTAT_COMPPEND(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_COMPPEND_SHIFT)) & ESPI_MSTAT_COMPPEND_MASK)

