zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_ESPI.h
#define ESPI_MSTAT_MASTPEND_MASK                 (0x80000U)
#define ESPI_MSTAT_MASTPEND_SHIFT                (19U)
/*! MASTPEND - Master Pending
 *  0b0..No mastering pending
 *  0b1..Mastering is pending (flash or memory)
 */
#define ESPI_MSTAT_MASTPEND(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_MASTPEND_SHIFT)) & ESPI_MSTAT_MASTPEND_MASK)

#define ESPI_MSTAT_ALERTPEND_MASK                (0x100000U)
#define ESPI_MSTAT_ALERTPEND_SHIFT               (20U)
/*! ALERTPEND - Alert Pending
 *  0b0..No alert request pending
 *  0b1..Alert request pin is pending, whether a separate pin or master-in slave-out (MISO). For LPC, indicates that SERIRQ is in process.
 */
#define ESPI_MSTAT_ALERTPEND(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_ALERTPEND_SHIFT)) & ESPI_MSTAT_ALERTPEND_MASK)
/*! @} */

/*! @name INTENSET - Interrupt Enable Set */
/*! @{ */

#define ESPI_INTENSET_PORTINT_MASK               (0x1FU)
#define ESPI_INTENSET_PORTINT_SHIFT              (0U)
/*! PORTINT - Port interrupt
 *  0b00000..Reserved
 *  0b00001..Corresponding port interrupts main processor, if it matches IRule
 */
#define ESPI_INTENSET_PORTINT(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_PORTINT_SHIFT)) & ESPI_INTENSET_PORTINT_MASK)

#define ESPI_INTENSET_P80INT_MASK                (0x100U)
#define ESPI_INTENSET_P80INT_SHIFT               (8U)
/*! P80INT - Port80 Interrupt
 *  0b0..Disabled
 *  0b1..Port80 interrupts main processor on update from host
 */
#define ESPI_INTENSET_P80INT(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_P80INT_SHIFT)) & ESPI_INTENSET_P80INT_MASK)

#define ESPI_INTENSET_BUSRST_MASK                (0x200U)
#define ESPI_INTENSET_BUSRST_SHIFT               (9U)
/*! BUSRST - Bus Reset
 *  0b0..Disabled
 *  0b1..A change in bus reset status interrupts CPU
 */
#define ESPI_INTENSET_BUSRST(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_BUSRST_SHIFT)) & ESPI_INTENSET_BUSRST_MASK)

#define ESPI_INTENSET_IRQUPD_MASK                (0x400U)
#define ESPI_INTENSET_IRQUPD_SHIFT               (10U)
/*! IRQUPD - IRQ Update
 *  0b0..Disabled
 *  0b1..Completion of an IRQ update interrupts CPU
 */
#define ESPI_INTENSET_IRQUPD(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_IRQUPD_SHIFT)) & ESPI_INTENSET_IRQUPD_MASK)

#define ESPI_INTENSET_WIRECHG_MASK               (0x800U)
#define ESPI_INTENSET_WIRECHG_SHIFT              (11U)
/*! WIRECHG - Wire Change
 *  0b0..Disabled
 *  0b1..When one or more VWire inputs have changed, interrupts CPU
 */
#define ESPI_INTENSET_WIRECHG(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_WIRECHG_SHIFT)) & ESPI_INTENSET_WIRECHG_MASK)

#define ESPI_INTENSET_HSTALL_MASK                (0x1000U)
#define ESPI_INTENSET_HSTALL_SHIFT               (12U)
/*! HSTALL - Host Stall
 *  0b0..Disabled
 *  0b1..When the MSTAT[HSTALL] is 1, interrupt main processor
 */
#define ESPI_INTENSET_HSTALL(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_HSTALL_SHIFT)) & ESPI_INTENSET_HSTALL_MASK)

#define ESPI_INTENSET_CRCERR_MASK                (0x2000U)
#define ESPI_INTENSET_CRCERR_SHIFT               (13U)
/*! CRCERR - CRC Error
 *  0b0..Disabled
 *  0b1..When CRC error detected, interrupts CPU
 */
#define ESPI_INTENSET_CRCERR(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_CRCERR_SHIFT)) & ESPI_INTENSET_CRCERR_MASK)

#define ESPI_INTENSET_GPIO_MASK                  (0x4000U)
#define ESPI_INTENSET_GPIO_SHIFT                 (14U)
/*! GPIO - GPIO
 *  0b0..Disabled
 *  0b1..When ESPICFG GPIO changes input value, interrupts CPU
 */
#define ESPI_INTENSET_GPIO(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_GPIO_SHIFT)) & ESPI_INTENSET_GPIO_MASK)

#define ESPI_INTENSET_CS_INT_MASK                (0x8000U)
#define ESPI_INTENSET_CS_INT_SHIFT               (15U)
/*! CS_INT - CS_INT
 *  0b0..Disabled
 *  0b1..When CS falls, interrupts the main processor (wake_async is asserted)
 */
#define ESPI_INTENSET_CS_INT(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_CS_INT_SHIFT)) & ESPI_INTENSET_CS_INT_MASK)

#define ESPI_INTENSET_CPORTINT_MASK              (0x1F0000U)
#define ESPI_INTENSET_CPORTINT_SHIFT             (16U)
/*! CPORTINT - Coprocessor Interrupt
 *  0b00000..Disabled
 *  0b00001..
 */
#define ESPI_INTENSET_CPORTINT(x)                (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_CPORTINT_SHIFT)) & ESPI_INTENSET_CPORTINT_MASK)

#define ESPI_INTENSET_CP80INT_MASK               (0x1000000U)
#define ESPI_INTENSET_CP80INT_SHIFT              (24U)
/*! CP80INT - Coprocessor Port80 Interrupt
 *  0b0..Disabled
 *  0b1..Port80 interrupts coprocessor on update from host
 */
#define ESPI_INTENSET_CP80INT(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_CP80INT_SHIFT)) & ESPI_INTENSET_CP80INT_MASK)

#define ESPI_INTENSET_CBUSRST_MASK               (0x2000000U)
#define ESPI_INTENSET_CBUSRST_SHIFT              (25U)
/*! CBUSRST - Coprocessor Burst
 *  0b0..Disabled
 *  0b1..Change in bus reset status interrupts coprocessor
 */
#define ESPI_INTENSET_CBUSRST(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_CBUSRST_SHIFT)) & ESPI_INTENSET_CBUSRST_MASK)

#define ESPI_INTENSET_CIRQUPD_MASK               (0x4000000U)
#define ESPI_INTENSET_CIRQUPD_SHIFT              (26U)
/*! CIRQUPD - Coprocessor Interrupt Update
 *  0b0..Disabled
 *  0b1..Completion of an IRQ update interrupts coprocessor
 */
#define ESPI_INTENSET_CIRQUPD(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_CIRQUPD_SHIFT)) & ESPI_INTENSET_CIRQUPD_MASK)

#define ESPI_INTENSET_CWIRECHG_MASK              (0x8000000U)
#define ESPI_INTENSET_CWIRECHG_SHIFT             (27U)
/*! CWIRECHG - Coprocessor Wire Change
 *  0b0..Disabled
 *  0b1..When one one or more Vwire inputs have changed, interrupts coprocessor
 */
#define ESPI_INTENSET_CWIRECHG(x)                (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_CWIRECHG_SHIFT)) & ESPI_INTENSET_CWIRECHG_MASK)

