zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_ESPI.h
#define ESPI_INTENSET_CHSTALL_MASK               (0x10000000U)
#define ESPI_INTENSET_CHSTALL_SHIFT              (28U)
/*! CHSTALL - Coprocessor Host Stall
 *  0b0..Disabled
 *  0b1..When MSTAT[HSTALL] is 1, interrupts coprocessor
 */
#define ESPI_INTENSET_CHSTALL(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_CHSTALL_SHIFT)) & ESPI_INTENSET_CHSTALL_MASK)

#define ESPI_INTENSET_CCRCERR_MASK               (0x20000000U)
#define ESPI_INTENSET_CCRCERR_SHIFT              (29U)
/*! CCRCERR - Coprocessor Error
 *  0b0..Disabled
 *  0b1..When CRC error detected, interrupts coprocessor
 */
#define ESPI_INTENSET_CCRCERR(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_CCRCERR_SHIFT)) & ESPI_INTENSET_CCRCERR_MASK)

#define ESPI_INTENSET_CGPIO_MASK                 (0x40000000U)
#define ESPI_INTENSET_CGPIO_SHIFT                (30U)
/*! CGPIO - Coprocessor GPIO
 *  0b0..Disabled
 *  0b1..When ESPICFG GPIO changes input value, interrupts coprocessor
 */
#define ESPI_INTENSET_CGPIO(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_CGPIO_SHIFT)) & ESPI_INTENSET_CGPIO_MASK)
/*! @} */

/*! @name INTENCLR - Interrupt Clear */
/*! @{ */

#define ESPI_INTENCLR_PORTINT_MASK               (0x1FU)
#define ESPI_INTENCLR_PORTINT_SHIFT              (0U)
/*! PORTINT - Port Interrupt
 *  0b00000..Reserved
 *  0b00001..Writes 0 to corresponding port interrupt enable
 */
#define ESPI_INTENCLR_PORTINT(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_PORTINT_SHIFT)) & ESPI_INTENCLR_PORTINT_MASK)

#define ESPI_INTENCLR_P80INT_MASK                (0x100U)
#define ESPI_INTENCLR_P80INT_SHIFT               (8U)
/*! P80INT - Port80 Interrupt
 *  0b0..Reserved
 *  0b1..Writes 0 to Port80 interrupt enable
 */
#define ESPI_INTENCLR_P80INT(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_P80INT_SHIFT)) & ESPI_INTENCLR_P80INT_MASK)

#define ESPI_INTENCLR_BUSRST_MASK                (0x200U)
#define ESPI_INTENCLR_BUSRST_SHIFT               (9U)
/*! BUSRST - Bus Reset
 *  0b0..Reserved
 *  0b1..Writes 0 to reset change interrupt enable
 */
#define ESPI_INTENCLR_BUSRST(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_BUSRST_SHIFT)) & ESPI_INTENCLR_BUSRST_MASK)

#define ESPI_INTENCLR_IRQUPD_MASK                (0x400U)
#define ESPI_INTENCLR_IRQUPD_SHIFT               (10U)
/*! IRQUPD - IRQ Update
 *  0b0..Reserved
 *  0b1..Writes 0 to IRQ completion interrupt enable
 */
#define ESPI_INTENCLR_IRQUPD(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_IRQUPD_SHIFT)) & ESPI_INTENCLR_IRQUPD_MASK)

#define ESPI_INTENCLR_WIRECHG_MASK               (0x800U)
#define ESPI_INTENCLR_WIRECHG_SHIFT              (11U)
/*! WIRECHG - Wire Change
 *  0b0..Reserved
 *  0b1..Writes 0 to Wire Change interrupt enable
 */
#define ESPI_INTENCLR_WIRECHG(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_WIRECHG_SHIFT)) & ESPI_INTENCLR_WIRECHG_MASK)

#define ESPI_INTENCLR_HSTALL_MASK                (0x1000U)
#define ESPI_INTENCLR_HSTALL_SHIFT               (12U)
/*! HSTALL - Host Stall
 *  0b0..Reserved
 *  0b1..Writes 0 to HSTALL interrupt enable
 */
#define ESPI_INTENCLR_HSTALL(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_HSTALL_SHIFT)) & ESPI_INTENCLR_HSTALL_MASK)

#define ESPI_INTENCLR_CRCERR_MASK                (0x2000U)
#define ESPI_INTENCLR_CRCERR_SHIFT               (13U)
/*! CRCERR - CRC Error
 *  0b0..Reserved
 *  0b1..Writes 0 to CRCERR interrupt enable
 */
#define ESPI_INTENCLR_CRCERR(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_CRCERR_SHIFT)) & ESPI_INTENCLR_CRCERR_MASK)

#define ESPI_INTENCLR_GPIO_MASK                  (0x4000U)
#define ESPI_INTENCLR_GPIO_SHIFT                 (14U)
/*! GPIO - GPIO
 *  0b0..Reserved
 *  0b1..Writes 0 to GPIO interrupt enable
 */
#define ESPI_INTENCLR_GPIO(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_GPIO_SHIFT)) & ESPI_INTENCLR_GPIO_MASK)

#define ESPI_INTENCLR_CS_INT_MASK                (0x8000U)
#define ESPI_INTENCLR_CS_INT_SHIFT               (15U)
/*! CS_INT - CS_INT
 *  0b0..Disabled
 *  0b1..Clear CS falls enable
 */
#define ESPI_INTENCLR_CS_INT(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_CS_INT_SHIFT)) & ESPI_INTENCLR_CS_INT_MASK)

#define ESPI_INTENCLR_CPORTINT_MASK              (0x1F0000U)
#define ESPI_INTENCLR_CPORTINT_SHIFT             (16U)
/*! CPORTINT - Coprocessor Interrupt
 *  0b00000..Reserved
 *  0b00001..Writes 0 to corresponding coprocessor port interrupt enable
 */
#define ESPI_INTENCLR_CPORTINT(x)                (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_CPORTINT_SHIFT)) & ESPI_INTENCLR_CPORTINT_MASK)

#define ESPI_INTENCLR_CP80INT_MASK               (0x1000000U)
#define ESPI_INTENCLR_CP80INT_SHIFT              (24U)
/*! CP80INT - Coprocesssor Port80 Interrupt
 *  0b0..Reserved
 *  0b1..Writes 0 to coprocessor Port80 interrupt enable.
 */
#define ESPI_INTENCLR_CP80INT(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_CP80INT_SHIFT)) & ESPI_INTENCLR_CP80INT_MASK)

#define ESPI_INTENCLR_CBUSRST_MASK               (0x2000000U)
#define ESPI_INTENCLR_CBUSRST_SHIFT              (25U)
/*! CBUSRST - Coprocessor Burst
 *  0b0..Reserved
 *  0b1..Writes 0 to coprocessor Reset change interrupt enable
 */
#define ESPI_INTENCLR_CBUSRST(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_CBUSRST_SHIFT)) & ESPI_INTENCLR_CBUSRST_MASK)

#define ESPI_INTENCLR_CIRQUPD_MASK               (0x4000000U)
#define ESPI_INTENCLR_CIRQUPD_SHIFT              (26U)
/*! CIRQUPD - Coprocessor IRQ Update
 *  0b0..Reserved
 *  0b1..Writes 0 to coprocessor IRQ completion interrupt enable
 */
#define ESPI_INTENCLR_CIRQUPD(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_CIRQUPD_SHIFT)) & ESPI_INTENCLR_CIRQUPD_MASK)

#define ESPI_INTENCLR_CWIRECHG_MASK              (0x8000000U)
#define ESPI_INTENCLR_CWIRECHG_SHIFT             (27U)
/*! CWIRECHG - Coprocessor Wire Change
 *  0b0..Reserved
 *  0b1..Writes 0 to coprocessor Wire Change interrupt enable
 */
#define ESPI_INTENCLR_CWIRECHG(x)                (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_CWIRECHG_SHIFT)) & ESPI_INTENCLR_CWIRECHG_MASK)

#define ESPI_INTENCLR_CHSTALL_MASK               (0x10000000U)
#define ESPI_INTENCLR_CHSTALL_SHIFT              (28U)
/*! CHSTALL - Coprocessor Host Stall
 *  0b0..Reserved
 *  0b1..Writes 0 to coprocessor HSTALL interrupt enable
 */
#define ESPI_INTENCLR_CHSTALL(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_CHSTALL_SHIFT)) & ESPI_INTENCLR_CHSTALL_MASK)

#define ESPI_INTENCLR_CCRCERR_MASK               (0x20000000U)
#define ESPI_INTENCLR_CCRCERR_SHIFT              (29U)
/*! CCRCERR - Coprocessor CRC Error
 *  0b0..Reserved
 *  0b1..Writes 0 to coprocessor CRCERR interrupt enable
 */
#define ESPI_INTENCLR_CCRCERR(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_CCRCERR_SHIFT)) & ESPI_INTENCLR_CCRCERR_MASK)

#define ESPI_INTENCLR_CGPIO_MASK                 (0x40000000U)
#define ESPI_INTENCLR_CGPIO_SHIFT                (30U)
/*! CGPIO - Coprocessor GPIO
 *  0b0..Reserved
 *  0b1..Writes 0 to coprocessor GPIO interrupt enable
 */
#define ESPI_INTENCLR_CGPIO(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_CGPIO_SHIFT)) & ESPI_INTENCLR_CGPIO_MASK)
/*! @} */

/*! @name INTSTAT - Masked Interrupt Status */
/*! @{ */

