zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_ESPI.h
#define ESPI_INTSTAT_PORTINT_MASK                (0x1FU)
#define ESPI_INTSTAT_PORTINT_SHIFT               (0U)
/*! PORTINT - Port Interrupt
 *  0b00000..Disabled
 *  0b00001..Corresponding port interrupts main processor if it matches IRule
 */
#define ESPI_INTSTAT_PORTINT(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_PORTINT_SHIFT)) & ESPI_INTSTAT_PORTINT_MASK)

#define ESPI_INTSTAT_P80INT_MASK                 (0x100U)
#define ESPI_INTSTAT_P80INT_SHIFT                (8U)
/*! P80INT - Port80 Interrupt
 *  0b0..Disabled
 *  0b1..Port80 interrupts main processor on update from host
 */
#define ESPI_INTSTAT_P80INT(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_P80INT_SHIFT)) & ESPI_INTSTAT_P80INT_MASK)

#define ESPI_INTSTAT_BUSRST_MASK                 (0x200U)
#define ESPI_INTSTAT_BUSRST_SHIFT                (9U)
/*! BUSRST - Bus Reset
 *  0b0..Disabled
 *  0b1..A change in Bus Reset status interrupts CPU
 */
#define ESPI_INTSTAT_BUSRST(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_BUSRST_SHIFT)) & ESPI_INTSTAT_BUSRST_MASK)

#define ESPI_INTSTAT_IRQUPD_MASK                 (0x400U)
#define ESPI_INTSTAT_IRQUPD_SHIFT                (10U)
/*! IRQUPD - IRQ Update
 *  0b0..Disabled
 *  0b1..Completion of an IRQ update interrupts CPU
 */
#define ESPI_INTSTAT_IRQUPD(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_IRQUPD_SHIFT)) & ESPI_INTSTAT_IRQUPD_MASK)

#define ESPI_INTSTAT_WIRECHG_MASK                (0x800U)
#define ESPI_INTSTAT_WIRECHG_SHIFT               (11U)
/*! WIRECHG - Wire Change
 *  0b0..Disabled
 *  0b1..The VWire input change interrupt is enabled and pending for the CPU
 */
#define ESPI_INTSTAT_WIRECHG(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_WIRECHG_SHIFT)) & ESPI_INTSTAT_WIRECHG_MASK)

#define ESPI_INTSTAT_HSTALL_MASK                 (0x1000U)
#define ESPI_INTSTAT_HSTALL_SHIFT                (12U)
/*! HSTALL - Host Stall
 *  0b0..Disabled
 *  0b1..The HSTALL interrupt is enabled and pending for the CPU
 */
#define ESPI_INTSTAT_HSTALL(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_HSTALL_SHIFT)) & ESPI_INTSTAT_HSTALL_MASK)

#define ESPI_INTSTAT_CRCERR_MASK                 (0x2000U)
#define ESPI_INTSTAT_CRCERR_SHIFT                (13U)
/*! CRCERR - CRC Error
 *  0b0..Disabled
 *  0b1..The CRC error interrupt is enabled and pending for the CPU
 */
#define ESPI_INTSTAT_CRCERR(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_CRCERR_SHIFT)) & ESPI_INTSTAT_CRCERR_MASK)

#define ESPI_INTSTAT_GPIO_MASK                   (0x4000U)
#define ESPI_INTSTAT_GPIO_SHIFT                  (14U)
/*! GPIO - GPIO
 *  0b0..Disabled
 *  0b1..The GPIO input change interrupt is enabled and pending for the CPU
 */
#define ESPI_INTSTAT_GPIO(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_GPIO_SHIFT)) & ESPI_INTSTAT_GPIO_MASK)

#define ESPI_INTSTAT_CPORTINT_MASK               (0x1F0000U)
#define ESPI_INTSTAT_CPORTINT_SHIFT              (16U)
/*! CPORTINT - Coprocessor Interrupt
 *  0b00000..Disabled
 *  0b00001..Interrupt is enabled and pending for the coprocessor
 */
#define ESPI_INTSTAT_CPORTINT(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_CPORTINT_SHIFT)) & ESPI_INTSTAT_CPORTINT_MASK)

#define ESPI_INTSTAT_CP80INT_MASK                (0x1000000U)
#define ESPI_INTSTAT_CP80INT_SHIFT               (24U)
/*! CP80INT - Coprocessor Port80 Interrupt
 *  0b0..Disabled
 *  0b1..Port80 interrupt is enabled and pending for the CPU. Port80 interrupts coprocessor on update from host.
 */
#define ESPI_INTSTAT_CP80INT(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_CP80INT_SHIFT)) & ESPI_INTSTAT_CP80INT_MASK)

#define ESPI_INTSTAT_CBUSRST_MASK                (0x2000000U)
#define ESPI_INTSTAT_CBUSRST_SHIFT               (25U)
/*! CBUSRST - Coprocessor Burst
 *  0b0..Disabled
 *  0b1..Bus reset status change interrupt is enabled and pending for the CPU. A change in bus reset status interrupts coprocessor.
 */
#define ESPI_INTSTAT_CBUSRST(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_CBUSRST_SHIFT)) & ESPI_INTSTAT_CBUSRST_MASK)

#define ESPI_INTSTAT_CIRQUPD_MASK                (0x4000000U)
#define ESPI_INTSTAT_CIRQUPD_SHIFT               (26U)
/*! CIRQUPD - Coprocessor IRQ Update
 *  0b0..Disabled
 *  0b1..IRQ update interrupt is enabled and pending for the CPU.
 */
#define ESPI_INTSTAT_CIRQUPD(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_CIRQUPD_SHIFT)) & ESPI_INTSTAT_CIRQUPD_MASK)

#define ESPI_INTSTAT_CWIRECHG_MASK               (0x8000000U)
#define ESPI_INTSTAT_CWIRECHG_SHIFT              (27U)
/*! CWIRECHG - Coprocessor Wire Change
 *  0b0..Disabled
 *  0b1..When one one or more Vwire input has changed, interrupts coprocessor.
 */
#define ESPI_INTSTAT_CWIRECHG(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_CWIRECHG_SHIFT)) & ESPI_INTSTAT_CWIRECHG_MASK)

#define ESPI_INTSTAT_CHSTALL_MASK                (0x10000000U)
#define ESPI_INTSTAT_CHSTALL_SHIFT               (28U)
/*! CHSTALL - Coprocessor Host Stall
 *  0b0..Disabled
 *  0b1..When MSTAT[HSTALL] is 1, interrupts coprocessor.
 */
#define ESPI_INTSTAT_CHSTALL(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_CHSTALL_SHIFT)) & ESPI_INTSTAT_CHSTALL_MASK)

#define ESPI_INTSTAT_CCRCERR_MASK                (0x20000000U)
#define ESPI_INTSTAT_CCRCERR_SHIFT               (29U)
/*! CCRCERR - Coprocessor CRC Error
 *  0b0..Disabled
 *  0b1..When a CRC error detected, interrupts coprocessor.
 */
#define ESPI_INTSTAT_CCRCERR(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_CCRCERR_SHIFT)) & ESPI_INTSTAT_CCRCERR_MASK)

#define ESPI_INTSTAT_CGPIO_MASK                  (0x40000000U)
#define ESPI_INTSTAT_CGPIO_SHIFT                 (30U)
/*! CGPIO - Coprocessor GPIO
 *  0b0..Disabled
 *  0b1..When ESPICFG GPIO changes input value, interrupts coprocessor.
 */
#define ESPI_INTSTAT_CGPIO(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_CGPIO_SHIFT)) & ESPI_INTSTAT_CGPIO_MASK)
/*! @} */

