zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_ESPI.h
/*! @name DMACTRL - DMA Control */
/*! @{ */

#define ESPI_DMACTRL_DMA0EN_MASK                 (0x3U)
#define ESPI_DMACTRL_DMA0EN_SHIFT                (0U)
/*! DMA0EN - DMA 0 Enable
 *  0b00..Disabled. The DMA channel is not used.
 *  0b01..Triggers on Host Read empty (whether endpoint and a byte or mailbox and many bytes). Allows reload of memory.
 *  0b10..Triggers on Host Write complete/ready (whether endpoint and a byte, or mailbox and many bytes).
 *  0b11..Reserved
 */
#define ESPI_DMACTRL_DMA0EN(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_DMACTRL_DMA0EN_SHIFT)) & ESPI_DMACTRL_DMA0EN_MASK)

#define ESPI_DMACTRL_DMA1EN_MASK                 (0xCU)
#define ESPI_DMACTRL_DMA1EN_SHIFT                (2U)
/*! DMA1EN - DMA 1 Enable
 *  0b00..Disabled. The DMA channel is not used.
 *  0b01..Triggers on Host Read empty (whether endpoint and a byte or mailbox and many bytes). Allows reload of memory.
 *  0b10..Triggers on Host Write complete/ready (whether endpoint and a byte or mailbox and many bytes).
 *  0b11..Reserved
 */
#define ESPI_DMACTRL_DMA1EN(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_DMACTRL_DMA1EN_SHIFT)) & ESPI_DMACTRL_DMA1EN_MASK)

#define ESPI_DMACTRL_DMA0PORT_MASK               (0xF00U)
#define ESPI_DMACTRL_DMA0PORT_SHIFT              (8U)
/*! DMA0PORT - DMA 0 Port */
#define ESPI_DMACTRL_DMA0PORT(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_DMACTRL_DMA0PORT_SHIFT)) & ESPI_DMACTRL_DMA0PORT_MASK)

#define ESPI_DMACTRL_DMA1PORT_MASK               (0xF000U)
#define ESPI_DMACTRL_DMA1PORT_SHIFT              (12U)
/*! DMA1PORT - Selects port operating DMA
 *  0b0000..Port 0
 *  0b0001..Port 1
 *  0b0010..Port 2
 *  0b0011..Port 3
 *  0b0100..Port 4
 *  0b0101..Reserved
 *  0b0110..Reserved
 *  0b0111..Reserved
 *  0b1000..Port80. Used to offload the Port80 bytes (only host writes apply to Port80).
 *  0b1001-0b1111..Reserved
 */
#define ESPI_DMACTRL_DMA1PORT(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_DMACTRL_DMA1PORT_SHIFT)) & ESPI_DMACTRL_DMA1PORT_MASK)

#define ESPI_DMACTRL_CNT0_MASK                   (0x7F0000U)
#define ESPI_DMACTRL_CNT0_SHIFT                  (16U)
/*! CNT0 - Reload Count 0 */
#define ESPI_DMACTRL_CNT0(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_DMACTRL_CNT0_SHIFT)) & ESPI_DMACTRL_CNT0_MASK)

#define ESPI_DMACTRL_CNT1_MASK                   (0x7F000000U)
#define ESPI_DMACTRL_CNT1_SHIFT                  (24U)
/*! CNT1 - Reload Count 1 */
#define ESPI_DMACTRL_CNT1(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_DMACTRL_CNT1_SHIFT)) & ESPI_DMACTRL_CNT1_MASK)
/*! @} */

/*! @name RAMBASE - RAM Base */
/*! @{ */

#define ESPI_RAMBASE_ZERO_MASK                   (0xFFFU)
#define ESPI_RAMBASE_ZERO_SHIFT                  (0U)
/*! ZERO - Always 0 */
#define ESPI_RAMBASE_ZERO(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_RAMBASE_ZERO_SHIFT)) & ESPI_RAMBASE_ZERO_MASK)

#define ESPI_RAMBASE_RAM_MASK                    (0xFFFFF000U)
#define ESPI_RAMBASE_RAM_SHIFT                   (12U)
/*! RAM - RAM Location */
#define ESPI_RAMBASE_RAM(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_RAMBASE_RAM_SHIFT)) & ESPI_RAMBASE_RAM_MASK)
/*! @} */

/*! @name MAPBASE - Mapped Base */
/*! @{ */

#define ESPI_MAPBASE_BASE0_MASK                  (0xFFFFU)
#define ESPI_MAPBASE_BASE0_SHIFT                 (0U)
/*! BASE0 - Base 0 */
#define ESPI_MAPBASE_BASE0(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_MAPBASE_BASE0_SHIFT)) & ESPI_MAPBASE_BASE0_MASK)

#define ESPI_MAPBASE_BASE1_MASK                  (0xFFFF0000U)
#define ESPI_MAPBASE_BASE1_SHIFT                 (16U)
/*! BASE1 - Base 1 */
#define ESPI_MAPBASE_BASE1(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_MAPBASE_BASE1_SHIFT)) & ESPI_MAPBASE_BASE1_MASK)
/*! @} */

/*! @name IRQPUSH - IRQ Push */
/*! @{ */

#define ESPI_IRQPUSH_IRQ_MASK                    (0xFFU)
#define ESPI_IRQPUSH_IRQ_SHIFT                   (0U)
/*! IRQ - Interrupt Request Queue */
#define ESPI_IRQPUSH_IRQ(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_IRQPUSH_IRQ_SHIFT)) & ESPI_IRQPUSH_IRQ_MASK)

#define ESPI_IRQPUSH_DONE_MASK                   (0x100U)
#define ESPI_IRQPUSH_DONE_SHIFT                  (8U)
/*! DONE - IRQ Update Done */
#define ESPI_IRQPUSH_DONE(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_IRQPUSH_DONE_SHIFT)) & ESPI_IRQPUSH_DONE_MASK)
/*! @} */

/*! @name WIREWO - Virtual Wire MCU-to-host */
/*! @{ */

#define ESPI_WIREWO_OOB_RST_ACK_MASK             (0x1U)
#define ESPI_WIREWO_OOB_RST_ACK_SHIFT            (0U)
/*! OOB_RST_ACK - Out-Of-Band Reset Acknowledge */
#define ESPI_WIREWO_OOB_RST_ACK(x)               (((uint32_t)(((uint32_t)(x)) << ESPI_WIREWO_OOB_RST_ACK_SHIFT)) & ESPI_WIREWO_OOB_RST_ACK_MASK)

#define ESPI_WIREWO_WAKEN_SCIN_MASK              (0x2U)
#define ESPI_WIREWO_WAKEN_SCIN_SHIFT             (1U)
/*! WAKEN_SCIN - IRQ1 */
#define ESPI_WIREWO_WAKEN_SCIN(x)                (((uint32_t)(((uint32_t)(x)) << ESPI_WIREWO_WAKEN_SCIN_SHIFT)) & ESPI_WIREWO_WAKEN_SCIN_MASK)

#define ESPI_WIREWO_PMEN_MASK                    (0x4U)
#define ESPI_WIREWO_PMEN_SHIFT                   (2U)
/*! PMEN - SMIN */
#define ESPI_WIREWO_PMEN(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_WIREWO_PMEN_SHIFT)) & ESPI_WIREWO_PMEN_MASK)

#define ESPI_WIREWO_SCIN_MASK                    (0x8U)
#define ESPI_WIREWO_SCIN_SHIFT                   (3U)
/*! SCIN - IRQ2 */
#define ESPI_WIREWO_SCIN(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_WIREWO_SCIN_SHIFT)) & ESPI_WIREWO_SCIN_MASK)

#define ESPI_WIREWO_SMIN_MASK                    (0x10U)
#define ESPI_WIREWO_SMIN_SHIFT                   (4U)
/*! SMIN - IRQ3 */
#define ESPI_WIREWO_SMIN(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_WIREWO_SMIN_SHIFT)) & ESPI_WIREWO_SMIN_MASK)

#define ESPI_WIREWO_RCINN_MASK                   (0x20U)
#define ESPI_WIREWO_RCINN_SHIFT                  (5U)
/*! RCINN - IRQ4 */
#define ESPI_WIREWO_RCINN(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_WIREWO_RCINN_SHIFT)) & ESPI_WIREWO_RCINN_MASK)

#define ESPI_WIREWO_HOST_RST_ACK_MASK            (0x40U)
#define ESPI_WIREWO_HOST_RST_ACK_SHIFT           (6U)
/*! HOST_RST_ACK - IRQ5 */
#define ESPI_WIREWO_HOST_RST_ACK(x)              (((uint32_t)(((uint32_t)(x)) << ESPI_WIREWO_HOST_RST_ACK_SHIFT)) & ESPI_WIREWO_HOST_RST_ACK_MASK)

