zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_ESPI.h
#define ESPI_WIREWO_SUSACKN_MASK                 (0x80U)
#define ESPI_WIREWO_SUSACKN_SHIFT                (7U)
/*! SUSACKN - IRQ6 */
#define ESPI_WIREWO_SUSACKN(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_WIREWO_SUSACKN_SHIFT)) & ESPI_WIREWO_SUSACKN_MASK)

#define ESPI_WIREWO_E2P_MASK                     (0xFF00U)
#define ESPI_WIREWO_E2P_SHIFT                    (8U)
/*! E2P - IRQ7-IRQ15 */
#define ESPI_WIREWO_E2P(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_WIREWO_E2P_SHIFT)) & ESPI_WIREWO_E2P_MASK)

#define ESPI_WIREWO_BOOT_DONE_MASK               (0x10000U)
#define ESPI_WIREWO_BOOT_DONE_SHIFT              (16U)
/*! BOOT_DONE - Boot Load Done */
#define ESPI_WIREWO_BOOT_DONE(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_WIREWO_BOOT_DONE_SHIFT)) & ESPI_WIREWO_BOOT_DONE_MASK)

#define ESPI_WIREWO_BOOT_ERRN_MASK               (0x20000U)
#define ESPI_WIREWO_BOOT_ERRN_SHIFT              (17U)
/*! BOOT_ERRN - Boot Load Error
 *  0b0..Boot load error
 *  0b1..Boot load successful
 */
#define ESPI_WIREWO_BOOT_ERRN(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_WIREWO_BOOT_ERRN_SHIFT)) & ESPI_WIREWO_BOOT_ERRN_MASK)

#define ESPI_WIREWO_DSW_PWROK_RST_MASK           (0x40000U)
#define ESPI_WIREWO_DSW_PWROK_RST_SHIFT          (18U)
/*! DSW_PWROK_RST - Force */
#define ESPI_WIREWO_DSW_PWROK_RST(x)             (((uint32_t)(((uint32_t)(x)) << ESPI_WIREWO_DSW_PWROK_RST_SHIFT)) & ESPI_WIREWO_DSW_PWROK_RST_MASK)

#define ESPI_WIREWO_DONE_MASK                    (0x80000000U)
#define ESPI_WIREWO_DONE_SHIFT                   (31U)
/*! DONE - Write Done
 *  0b0..Write not done
 *  0b1..Write done
 */
#define ESPI_WIREWO_DONE(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_WIREWO_DONE_SHIFT)) & ESPI_WIREWO_DONE_MASK)
/*! @} */

/*! @name WIRERO - Virtual Wire Host-to-MCU */
/*! @{ */

#define ESPI_WIRERO_SLP_S3N_MASK                 (0x1U)
#define ESPI_WIRERO_SLP_S3N_SHIFT                (0U)
/*! SLP_S3N - Sleep State 3 */
#define ESPI_WIRERO_SLP_S3N(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_WIRERO_SLP_S3N_SHIFT)) & ESPI_WIRERO_SLP_S3N_MASK)

#define ESPI_WIRERO_SLP_S4N_MASK                 (0x2U)
#define ESPI_WIRERO_SLP_S4N_SHIFT                (1U)
/*! SLP_S4N - Sleep State 4 */
#define ESPI_WIRERO_SLP_S4N(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_WIRERO_SLP_S4N_SHIFT)) & ESPI_WIRERO_SLP_S4N_MASK)

#define ESPI_WIRERO_SLP_S5N_MASK                 (0x4U)
#define ESPI_WIRERO_SLP_S5N_SHIFT                (2U)
/*! SLP_S5N - Sleep State 5 */
#define ESPI_WIRERO_SLP_S5N(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_WIRERO_SLP_S5N_SHIFT)) & ESPI_WIRERO_SLP_S5N_MASK)

#define ESPI_WIRERO_SUS_STAT_MASK                (0x8U)
#define ESPI_WIRERO_SUS_STAT_SHIFT               (3U)
/*! SUS_STAT - Suspend Status */
#define ESPI_WIRERO_SUS_STAT(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_WIRERO_SUS_STAT_SHIFT)) & ESPI_WIRERO_SUS_STAT_MASK)

#define ESPI_WIRERO_PLTRSTN_MASK                 (0x10U)
#define ESPI_WIRERO_PLTRSTN_SHIFT                (4U)
/*! PLTRSTN - Reset Request */
#define ESPI_WIRERO_PLTRSTN(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_WIRERO_PLTRSTN_SHIFT)) & ESPI_WIRERO_PLTRSTN_MASK)

#define ESPI_WIRERO_OOB_RST_WARN_MASK            (0x20U)
#define ESPI_WIRERO_OOB_RST_WARN_SHIFT           (5U)
/*! OOB_RST_WARN - Out-Of-Band Reset Warning */
#define ESPI_WIRERO_OOB_RST_WARN(x)              (((uint32_t)(((uint32_t)(x)) << ESPI_WIRERO_OOB_RST_WARN_SHIFT)) & ESPI_WIRERO_OOB_RST_WARN_MASK)

#define ESPI_WIRERO_HOST_RST_WARN_MASK           (0x40U)
#define ESPI_WIRERO_HOST_RST_WARN_SHIFT          (6U)
/*! HOST_RST_WARN - Host Reset Warning */
#define ESPI_WIRERO_HOST_RST_WARN(x)             (((uint32_t)(((uint32_t)(x)) << ESPI_WIRERO_HOST_RST_WARN_SHIFT)) & ESPI_WIRERO_HOST_RST_WARN_MASK)

#define ESPI_WIRERO_SUS_WARN_MASK                (0x80U)
#define ESPI_WIRERO_SUS_WARN_SHIFT               (7U)
/*! SUS_WARN - Suspend Warning */
#define ESPI_WIRERO_SUS_WARN(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_WIRERO_SUS_WARN_SHIFT)) & ESPI_WIRERO_SUS_WARN_MASK)

#define ESPI_WIRERO_SUS_PWRDN_ACKN_MASK          (0x100U)
#define ESPI_WIRERO_SUS_PWRDN_ACKN_SHIFT         (8U)
/*! SUS_PWRDN_ACKN - Suspend Power Well Acknowledge */
#define ESPI_WIRERO_SUS_PWRDN_ACKN(x)            (((uint32_t)(((uint32_t)(x)) << ESPI_WIRERO_SUS_PWRDN_ACKN_SHIFT)) & ESPI_WIRERO_SUS_PWRDN_ACKN_MASK)

#define ESPI_WIRERO_SLP_AN_MASK                  (0x200U)
#define ESPI_WIRERO_SLP_AN_SHIFT                 (9U)
/*! SLP_AN - Sleep AN */
#define ESPI_WIRERO_SLP_AN(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_WIRERO_SLP_AN_SHIFT)) & ESPI_WIRERO_SLP_AN_MASK)

#define ESPI_WIRERO_SLP_LAN_MASK                 (0x400U)
#define ESPI_WIRERO_SLP_LAN_SHIFT                (10U)
/*! SLP_LAN - Wired LAN Sleep */
#define ESPI_WIRERO_SLP_LAN(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_WIRERO_SLP_LAN_SHIFT)) & ESPI_WIRERO_SLP_LAN_MASK)

#define ESPI_WIRERO_SLP_WLAN_MASK                (0x800U)
#define ESPI_WIRERO_SLP_WLAN_SHIFT               (11U)
/*! SLP_WLAN - Wireless LAN Sleep */
#define ESPI_WIRERO_SLP_WLAN(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_WIRERO_SLP_WLAN_SHIFT)) & ESPI_WIRERO_SLP_WLAN_MASK)

#define ESPI_WIRERO_P2E_MASK                     (0xFF000U)
#define ESPI_WIRERO_P2E_SHIFT                    (12U)
/*! P2E - PCIe to EC */
#define ESPI_WIRERO_P2E(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_WIRERO_P2E_SHIFT)) & ESPI_WIRERO_P2E_MASK)

#define ESPI_WIRERO_HOST_C10N_MASK               (0x100000U)
#define ESPI_WIRERO_HOST_C10N_SHIFT              (20U)
/*! HOST_C10N - Host Entering Deep Power Down C10 State */
#define ESPI_WIRERO_HOST_C10N(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_WIRERO_HOST_C10N_SHIFT)) & ESPI_WIRERO_HOST_C10N_MASK)
/*! @} */

/*! @name P80STAT - Port 80 Status */
/*! @{ */

#define ESPI_P80STAT_CURR_MASK                   (0xFFU)
#define ESPI_P80STAT_CURR_SHIFT                  (0U)
/*! CURR - Current Port80 Value */
#define ESPI_P80STAT_CURR(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_P80STAT_CURR_SHIFT)) & ESPI_P80STAT_CURR_MASK)

