zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_ESPI.h
#define ESPI_P80STAT_PREV_MASK                   (0xFF00U)
#define ESPI_P80STAT_PREV_SHIFT                  (8U)
/*! PREV - Previous Port80 Value */
#define ESPI_P80STAT_PREV(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_P80STAT_PREV_SHIFT)) & ESPI_P80STAT_PREV_MASK)

#define ESPI_P80STAT_CNT_MASK                    (0xF0000U)
#define ESPI_P80STAT_CNT_SHIFT                   (16U)
/*! CNT - Counter */
#define ESPI_P80STAT_CNT(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_P80STAT_CNT_SHIFT)) & ESPI_P80STAT_CNT_MASK)

#define ESPI_P80STAT_RST_MASK                    (0x100000U)
#define ESPI_P80STAT_RST_SHIFT                   (20U)
/*! RST - Counter Reset */
#define ESPI_P80STAT_RST(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_P80STAT_RST_SHIFT)) & ESPI_P80STAT_RST_MASK)
/*! @} */

/*! @name STATADDR - Status Block Address */
/*! @{ */

#define ESPI_STATADDR_OFF_MASK                   (0xFFF8U)
#define ESPI_STATADDR_OFF_SHIFT                  (3U)
/*! OFF - Offset */
#define ESPI_STATADDR_OFF(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_STATADDR_OFF_SHIFT)) & ESPI_STATADDR_OFF_MASK)

#define ESPI_STATADDR_BASE_MASK                  (0x30000U)
#define ESPI_STATADDR_BASE_SHIFT                 (16U)
/*! BASE - Offset Base
 *  0b00..Offset from 0 in host memory or I/O space
 *  0b01..Base1 offset in host memory
 *  0b10..Base2 offset in host memory
 *  0b11..Reserved
 */
#define ESPI_STATADDR_BASE(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_STATADDR_BASE_SHIFT)) & ESPI_STATADDR_BASE_MASK)
/*! @} */

/*! @name ESPICAP - eSPI Capabilities */
/*! @{ */

#define ESPI_ESPICAP_SPICAP_MASK                 (0x3U)
#define ESPI_ESPICAP_SPICAP_SHIFT                (0U)
/*! SPICAP - SPI mode allowed (host still has to select):
 *  0b00..SPI only
 *  0b01..BiSPI and SPI
 *  0b10..FLEXSPI and SPI
 *  0b11..Any
 */
#define ESPI_ESPICAP_SPICAP(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICAP_SPICAP_SHIFT)) & ESPI_ESPICAP_SPICAP_MASK)

#define ESPI_ESPICAP_MAXSPD_MASK                 (0x70U)
#define ESPI_ESPICAP_MAXSPD_SHIFT                (4U)
/*! MAXSPD - Maximum SPI Clock Speed
 *  0b000..<=20 MHz
 *  0b001..<=25 MHz (24 Mhz)
 *  0b010..<=33 MHz (30 MHz)
 *  0b011..<=50 MHz (48 MHz)
 *  0b100..<=66 MHz (60 MHz)
 */
#define ESPI_ESPICAP_MAXSPD(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICAP_MAXSPD_SHIFT)) & ESPI_ESPICAP_MAXSPD_MASK)

#define ESPI_ESPICAP_ALPIN_MASK                  (0x80U)
#define ESPI_ESPICAP_ALPIN_SHIFT                 (7U)
/*! ALPIN - Alert Pin */
#define ESPI_ESPICAP_ALPIN(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICAP_ALPIN_SHIFT)) & ESPI_ESPICAP_ALPIN_MASK)

#define ESPI_ESPICAP_OOBOK_MASK                  (0x100U)
#define ESPI_ESPICAP_OOBOK_SHIFT                 (8U)
/*! OOBOK - OOB Allow
 *  0b0..Do not allow OOB
 *  0b1..Allow OOB
 */
#define ESPI_ESPICAP_OOBOK(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICAP_OOBOK_SHIFT)) & ESPI_ESPICAP_OOBOK_MASK)

#define ESPI_ESPICAP_FLASHMX_MASK                (0xC00U)
#define ESPI_ESPICAP_FLASHMX_SHIFT               (10U)
/*! FLASHMX - Maximum Flash Payload Size
 *  0b00..64 bytes
 *  0b01..128 bytes
 *  0b10..256 bytes
 *  0b11..512 bytes
 */
#define ESPI_ESPICAP_FLASHMX(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICAP_FLASHMX_SHIFT)) & ESPI_ESPICAP_FLASHMX_MASK)

#define ESPI_ESPICAP_SAF_MASK                    (0x1000U)
#define ESPI_ESPICAP_SAF_SHIFT                   (12U)
/*! SAF - Slave-Attached Flash
 *  0b0..Host cannot support SAF
 *  0b1..SAF is possible with the firmware.
 */
#define ESPI_ESPICAP_SAF(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICAP_SAF_SHIFT)) & ESPI_ESPICAP_SAF_MASK)

#define ESPI_ESPICAP_SAFERA_MASK                 (0x1E000U)
#define ESPI_ESPICAP_SAFERA_SHIFT                (13U)
/*! SAFERA - SAF Erase Sector
 *  0b0000..2 kB
 *  0b0001..4 kB
 *  0b0010..8 kB
 *  0b0011..16 kB
 */
#define ESPI_ESPICAP_SAFERA(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICAP_SAFERA_SHIFT)) & ESPI_ESPICAP_SAFERA_MASK)

#define ESPI_ESPICAP_MAF_MASK                    (0x20000U)
#define ESPI_ESPICAP_MAF_SHIFT                   (17U)
/*! MAF - Master-Attached Flash
 *  0b0..Host cannot support MAF
 *  0b1..If 1, then Master Attached Flash is possible with this firmware
 */
#define ESPI_ESPICAP_MAF(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICAP_MAF_SHIFT)) & ESPI_ESPICAP_MAF_MASK)

#define ESPI_ESPICAP_TRGT_REQ_SIZE_SUPP_MASK     (0x1C0000U)
#define ESPI_ESPICAP_TRGT_REQ_SIZE_SUPP_SHIFT    (18U)
/*! TRGT_REQ_SIZE_SUPP - Target Maximum Read Request Size Supported
 *  0b000..Reserved
 *  0b001..64 bytes max read request size
 *  0b010..128 bytes max read request size
 *  0b011..256 bytes max read request size
 *  0b100..512 bytes max read request size
 *  0b101..1024 bytes max read request size
 *  0b110..2048 bytes max read request size
 *  0b111..4096 bytes max read request size
 */
#define ESPI_ESPICAP_TRGT_REQ_SIZE_SUPP(x)       (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICAP_TRGT_REQ_SIZE_SUPP_SHIFT)) & ESPI_ESPICAP_TRGT_REQ_SIZE_SUPP_MASK)

#define ESPI_ESPICAP_MEMMX_MASK                  (0x600000U)
#define ESPI_ESPICAP_MEMMX_SHIFT                 (21U)
/*! MEMMX - Peripheral Channel Maximum Payload Size Supported
 *  0b00..Reserved
 *  0b01..64 bytes address aligned max payload size
 *  0b10..128 bytes address aligned max payload size
 *  0b11..256 bytes address aligned max payload size
 */
#define ESPI_ESPICAP_MEMMX(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICAP_MEMMX_SHIFT)) & ESPI_ESPICAP_MEMMX_MASK)

#define ESPI_ESPICAP_OOBMX_MASK                  (0x1800000U)
#define ESPI_ESPICAP_OOBMX_SHIFT                 (23U)
/*! OOBMX - OOB Message Channel Maximum Payload Size Supported
 *  0b00..Reserved
 *  0b01..64 bytes address aligned max payload size
 *  0b10..128 bytes address aligned max payload size
 *  0b11..256 bytes address aligned max payload size
 */
#define ESPI_ESPICAP_OOBMX(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICAP_OOBMX_SHIFT)) & ESPI_ESPICAP_OOBMX_MASK)
/*! @} */

