zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_ESPI.h
/*! @name ESPICFG - eSPI Configuration */
/*! @{ */

#define ESPI_ESPICFG_SAF_MASK                    (0x1U)
#define ESPI_ESPICFG_SAF_SHIFT                   (0U)
/*! SAF - Slave-Attached Flash Supported
 *  0b0..Host cannot support SAF
 *  0b1..Slave Attached Flash is possible with the firmware.
 */
#define ESPI_ESPICFG_SAF(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_SAF_SHIFT)) & ESPI_ESPICFG_SAF_MASK)

#define ESPI_ESPICFG_FLASHSZ_MASK                (0x6U)
#define ESPI_ESPICFG_FLASHSZ_SHIFT               (1U)
/*! FLASHSZ - Flash Size
 *  0b00..64 bytes
 *  0b01..128 bytes
 *  0b10..256 bytes
 *  0b11..512 bytes
 */
#define ESPI_ESPICFG_FLASHSZ(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_FLASHSZ_SHIFT)) & ESPI_ESPICFG_FLASHSZ_MASK)

#define ESPI_ESPICFG_SPIMOD_MASK                 (0x18U)
#define ESPI_ESPICFG_SPIMOD_SHIFT                (3U)
/*! SPIMOD - SPI Mode
 *  0b00..SPI
 *  0b01..BiSPI
 *  0b10..FLEXSPI
 */
#define ESPI_ESPICFG_SPIMOD(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_SPIMOD_SHIFT)) & ESPI_ESPICFG_SPIMOD_MASK)

#define ESPI_ESPICFG_ALERT_MASK                  (0x20U)
#define ESPI_ESPICFG_ALERT_SHIFT                 (5U)
/*! ALERT - Alert Is Pin */
#define ESPI_ESPICFG_ALERT(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_ALERT_SHIFT)) & ESPI_ESPICFG_ALERT_MASK)

#define ESPI_ESPICFG_ALERTOD_MASK                (0x40U)
#define ESPI_ESPICFG_ALERTOD_SHIFT               (6U)
/*! ALERTOD - Alert Is Open Drain as Pin */
#define ESPI_ESPICFG_ALERTOD(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_ALERTOD_SHIFT)) & ESPI_ESPICFG_ALERTOD_MASK)

#define ESPI_ESPICFG_SPISPD_MASK                 (0x380U)
#define ESPI_ESPICFG_SPISPD_SHIFT                (7U)
/*! SPISPD - SPI Speed
 *  0b000..20 MHz or less
 *  0b001..25 MHz or 24 MHz
 *  0b010..33 MHz or 30 MHz
 *  0b011..50 MHz or 48 MHz
 *  0b100..66 MHz or 60 MHz
 */
#define ESPI_ESPICFG_SPISPD(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_SPISPD_SHIFT)) & ESPI_ESPICFG_SPISPD_MASK)

#define ESPI_ESPICFG_CRC_MASK                    (0x400U)
#define ESPI_ESPICFG_CRC_SHIFT                   (10U)
/*! CRC - CRC Checking Enabled */
#define ESPI_ESPICFG_CRC(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_CRC_SHIFT)) & ESPI_ESPICFG_CRC_MASK)

#define ESPI_ESPICFG_BUSMOK_MASK                 (0x800U)
#define ESPI_ESPICFG_BUSMOK_SHIFT                (11U)
/*! BUSMOK - Bus Master OK */
#define ESPI_ESPICFG_BUSMOK(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_BUSMOK_SHIFT)) & ESPI_ESPICFG_BUSMOK_MASK)

#define ESPI_ESPICFG_MEMENA_MASK                 (0x1000U)
#define ESPI_ESPICFG_MEMENA_SHIFT                (12U)
/*! MEMENA - Channel 0 (Memory) Enabled */
#define ESPI_ESPICFG_MEMENA(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_MEMENA_SHIFT)) & ESPI_ESPICFG_MEMENA_MASK)

#define ESPI_ESPICFG_VWOK_MASK                   (0x2000U)
#define ESPI_ESPICFG_VWOK_SHIFT                  (13U)
/*! VWOK - Channel 1 (VWire) Enabled */
#define ESPI_ESPICFG_VWOK(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_VWOK_SHIFT)) & ESPI_ESPICFG_VWOK_MASK)

#define ESPI_ESPICFG_OOBOK_MASK                  (0x4000U)
#define ESPI_ESPICFG_OOBOK_SHIFT                 (14U)
/*! OOBOK - Channel 2 (OOB) Enabled */
#define ESPI_ESPICFG_OOBOK(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_OOBOK_SHIFT)) & ESPI_ESPICFG_OOBOK_MASK)

#define ESPI_ESPICFG_FLSHERA_MASK                (0x38000U)
#define ESPI_ESPICFG_FLSHERA_SHIFT               (15U)
/*! FLSHERA - Flash Erase Size and Whether Enabled
 *  0b000..Flash not enabled
 *  0b001..Erase is 4 kB
 *  0b010..Erase is 64 kB
 *  0b011..Erase allows 4 kB and 64 kB
 *  0b100..Erase is 128 kB
 *  0b101..Erase is 256 kB
 */
#define ESPI_ESPICFG_FLSHERA(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_FLSHERA_SHIFT)) & ESPI_ESPICFG_FLSHERA_MASK)

#define ESPI_ESPICFG_FLSHOK_MASK                 (0x40000U)
#define ESPI_ESPICFG_FLSHOK_SHIFT                (18U)
/*! FLSHOK - Channel 3 (Flash) Enabled */
#define ESPI_ESPICFG_FLSHOK(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_FLSHOK_SHIFT)) & ESPI_ESPICFG_FLSHOK_MASK)

#define ESPI_ESPICFG_MEMSZ_MASK                  (0x180000U)
#define ESPI_ESPICFG_MEMSZ_SHIFT                 (19U)
/*! MEMSZ - Peripheral Channel Maximum Payload Size Selected
 *  0b00..Reserved
 *  0b01..64-byte payload for memory
 *  0b10..128-byte payload for memory and OOB access
 *  0b11..256-byte payload for memory and OOB access
 */
#define ESPI_ESPICFG_MEMSZ(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_MEMSZ_SHIFT)) & ESPI_ESPICFG_MEMSZ_MASK)

#define ESPI_ESPICFG_OOBSZ_MASK                  (0x600000U)
#define ESPI_ESPICFG_OOBSZ_SHIFT                 (21U)
/*! OOBSZ - OOB Message Channel Maximum Payload Size Selected
 *  0b00..Reserved
 *  0b01..64-byte payload for memory
 *  0b10..128-byte payload for memory and OOB access
 *  0b11..256-byte payload for memory and OOB access
 */
#define ESPI_ESPICFG_OOBSZ(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_OOBSZ_SHIFT)) & ESPI_ESPICFG_OOBSZ_MASK)
/*! @} */

/*! @name ESPIMISC - eSPI Miscellaneous */
/*! @{ */

#define ESPI_ESPIMISC_GPIO_OE_MASK               (0x1U)
#define ESPI_ESPIMISC_GPIO_OE_SHIFT              (0U)
/*! GPIO_OE - GPIO Output Enable
 *  0b0..Input (High-Z)
 *  0b1..Alert or reset pin is set as an output GPIO.
 */
#define ESPI_ESPIMISC_GPIO_OE(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_ESPIMISC_GPIO_OE_SHIFT)) & ESPI_ESPIMISC_GPIO_OE_MASK)

#define ESPI_ESPIMISC_GPIO_OD_MASK               (0x2U)
#define ESPI_ESPIMISC_GPIO_OD_SHIFT              (1U)
/*! GPIO_OD - GPIO Open Drain
 *  0b0..Reserved
 *  0b1..Alert/Reset pin acts as open drain when ESPIMISC[GPIO_OE] = 1. This means ESPIMISC[GPIO_OUT] = 0 is low,
 *       and ESPIMISC[GPIO_OUT] = 1 is high-Z.
 */
#define ESPI_ESPIMISC_GPIO_OD(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_ESPIMISC_GPIO_OD_SHIFT)) & ESPI_ESPIMISC_GPIO_OD_MASK)

#define ESPI_ESPIMISC_GPIO_OUT_MASK              (0x4U)
#define ESPI_ESPIMISC_GPIO_OUT_SHIFT             (2U)
/*! GPIO_OUT
 *  0b0..Low
 *  0b1..High, high-Z if ESPIMISC[GPIO_OD] = 1.
 */
#define ESPI_ESPIMISC_GPIO_OUT(x)                (((uint32_t)(((uint32_t)(x)) << ESPI_ESPIMISC_GPIO_OUT_SHIFT)) & ESPI_ESPIMISC_GPIO_OUT_MASK)

#define ESPI_ESPIMISC_GPIO_IN_MASK               (0x8U)
#define ESPI_ESPIMISC_GPIO_IN_SHIFT              (3U)
/*! GPIO_IN - GPIO Input */
#define ESPI_ESPIMISC_GPIO_IN(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_ESPIMISC_GPIO_IN_SHIFT)) & ESPI_ESPIMISC_GPIO_IN_MASK)

