zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_ESPI.h
#define ESPI_ESPIMISC_RISGP_MASK                 (0x10U)
#define ESPI_ESPIMISC_RISGP_SHIFT                (4U)
/*! RISGP - RSTN Pin Is GPIO
 *  0b0..Reserved
 *  0b1..In eSPI mode, if this bit is 1, RSTN pin is not used as Reset (affects behavior). It can be used as GPIO
 *       if Alert is dedicated to Alert (instead of MISO). This option does not apply in LPC mode.
 */
#define ESPI_ESPIMISC_RISGP(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_ESPIMISC_RISGP_SHIFT)) & ESPI_ESPIMISC_RISGP_MASK)

#define ESPI_ESPIMISC_PWRSAV_MASK                (0x80000000U)
#define ESPI_ESPIMISC_PWRSAV_SHIFT               (31U)
/*! PWRSAV - Power Save */
#define ESPI_ESPIMISC_PWRSAV(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_ESPIMISC_PWRSAV_SHIFT)) & ESPI_ESPIMISC_PWRSAV_MASK)
/*! @} */

/*! @name RPMC_SUPPORT1 - RPMC Support 1 */
/*! @{ */

#define ESPI_RPMC_SUPPORT1_TARGET_RPMC_SUPPORTED_MASK (0x3FU)
#define ESPI_RPMC_SUPPORT1_TARGET_RPMC_SUPPORTED_SHIFT (0U)
/*! TARGET_RPMC_SUPPORTED - Target RPMC Supported
 *  0b000000..Target does not support Replay Protected Monotonic counter
 *  0b000001..Target supports up to 1 Replay Protected Monotonic counter
 *  0b000010..Target supports up to 2 Replay Protected Monotonic counters
 *  0b000011..Target supports up to 63 Replay Protected Monotonic counters. The value of this field is the total
 *            sum of Replay Protected Monotonic counters supported by all RPMC flash devices behind the target. If
 *            RPMC is not supported by the target, this field must indicate a value of 0h.
 */
#define ESPI_RPMC_SUPPORT1_TARGET_RPMC_SUPPORTED(x) (((uint32_t)(((uint32_t)(x)) << ESPI_RPMC_SUPPORT1_TARGET_RPMC_SUPPORTED_SHIFT)) & ESPI_RPMC_SUPPORT1_TARGET_RPMC_SUPPORTED_MASK)

#define ESPI_RPMC_SUPPORT1_NUM_OF_TARGET_MASK    (0xC0U)
#define ESPI_RPMC_SUPPORT1_NUM_OF_TARGET_SHIFT   (6U)
/*! NUM_OF_TARGET - Number of Target Attached Flash RPMC flash devices
 *  0b00..1 RPMC flash device is supported
 *  0b01..2 RPMC flash device is supported
 *  0b10..3 RPMC flash device is supported
 *  0b11..4 RPMC flash device is supported
 */
#define ESPI_RPMC_SUPPORT1_NUM_OF_TARGET(x)      (((uint32_t)(((uint32_t)(x)) << ESPI_RPMC_SUPPORT1_NUM_OF_TARGET_SHIFT)) & ESPI_RPMC_SUPPORT1_NUM_OF_TARGET_MASK)

#define ESPI_RPMC_SUPPORT1_RPMC_OP1_MASK         (0xFF00U)
#define ESPI_RPMC_SUPPORT1_RPMC_OP1_SHIFT        (8U)
/*! RPMC_OP1 - RPMC OP1 Opcode on the 1st RPMC Flash device */
#define ESPI_RPMC_SUPPORT1_RPMC_OP1(x)           (((uint32_t)(((uint32_t)(x)) << ESPI_RPMC_SUPPORT1_RPMC_OP1_SHIFT)) & ESPI_RPMC_SUPPORT1_RPMC_OP1_MASK)

#define ESPI_RPMC_SUPPORT1_RPMC_COUNTER_MASK     (0xF0000U)
#define ESPI_RPMC_SUPPORT1_RPMC_COUNTER_SHIFT    (16U)
/*! RPMC_COUNTER - RPMC Counter on the 1st RPMC Flash device */
#define ESPI_RPMC_SUPPORT1_RPMC_COUNTER(x)       (((uint32_t)(((uint32_t)(x)) << ESPI_RPMC_SUPPORT1_RPMC_COUNTER_SHIFT)) & ESPI_RPMC_SUPPORT1_RPMC_COUNTER_MASK)

#define ESPI_RPMC_SUPPORT1_RPMC_OP1_2_MASK       (0xFF00000U)
#define ESPI_RPMC_SUPPORT1_RPMC_OP1_2_SHIFT      (20U)
/*! RPMC_OP1_2 - RPMC OP1 Opcode on the 2nd RPMC Flash device */
#define ESPI_RPMC_SUPPORT1_RPMC_OP1_2(x)         (((uint32_t)(((uint32_t)(x)) << ESPI_RPMC_SUPPORT1_RPMC_OP1_2_SHIFT)) & ESPI_RPMC_SUPPORT1_RPMC_OP1_2_MASK)

#define ESPI_RPMC_SUPPORT1_RPMC_COUNTER_2_MASK   (0xF0000000U)
#define ESPI_RPMC_SUPPORT1_RPMC_COUNTER_2_SHIFT  (28U)
/*! RPMC_COUNTER_2 - RPMC Counter on the 2nd RPMC Flash device */
#define ESPI_RPMC_SUPPORT1_RPMC_COUNTER_2(x)     (((uint32_t)(((uint32_t)(x)) << ESPI_RPMC_SUPPORT1_RPMC_COUNTER_2_SHIFT)) & ESPI_RPMC_SUPPORT1_RPMC_COUNTER_2_MASK)
/*! @} */

/*! @name RPMC_SUPPORT2 - RPMC Support 2 */
/*! @{ */

#define ESPI_RPMC_SUPPORT2_RPMC_COUNTER_3_MASK   (0xFU)
#define ESPI_RPMC_SUPPORT2_RPMC_COUNTER_3_SHIFT  (0U)
/*! RPMC_COUNTER_3 - RPMC Counter on the 3rd RPMC Flash device */
#define ESPI_RPMC_SUPPORT2_RPMC_COUNTER_3(x)     (((uint32_t)(((uint32_t)(x)) << ESPI_RPMC_SUPPORT2_RPMC_COUNTER_3_SHIFT)) & ESPI_RPMC_SUPPORT2_RPMC_COUNTER_3_MASK)

#define ESPI_RPMC_SUPPORT2_RPMC_OP1_3_MASK       (0xFF0U)
#define ESPI_RPMC_SUPPORT2_RPMC_OP1_3_SHIFT      (4U)
/*! RPMC_OP1_3 - RPMC OP1 Opcode on the 3rd RPMC Flash device */
#define ESPI_RPMC_SUPPORT2_RPMC_OP1_3(x)         (((uint32_t)(((uint32_t)(x)) << ESPI_RPMC_SUPPORT2_RPMC_OP1_3_SHIFT)) & ESPI_RPMC_SUPPORT2_RPMC_OP1_3_MASK)

#define ESPI_RPMC_SUPPORT2_RPMC_COUNTER_4_MASK   (0xF000U)
#define ESPI_RPMC_SUPPORT2_RPMC_COUNTER_4_SHIFT  (12U)
/*! RPMC_COUNTER_4 - RPMC Counter on the 4th RPMC Flash device */
#define ESPI_RPMC_SUPPORT2_RPMC_COUNTER_4(x)     (((uint32_t)(((uint32_t)(x)) << ESPI_RPMC_SUPPORT2_RPMC_COUNTER_4_SHIFT)) & ESPI_RPMC_SUPPORT2_RPMC_COUNTER_4_MASK)

#define ESPI_RPMC_SUPPORT2_RPMC_OP1_4_MASK       (0xFF0000U)
#define ESPI_RPMC_SUPPORT2_RPMC_OP1_4_SHIFT      (16U)
/*! RPMC_OP1_4 - RPMC OP1 Opcode on the 4th RPMC Flash device */
#define ESPI_RPMC_SUPPORT2_RPMC_OP1_4(x)         (((uint32_t)(((uint32_t)(x)) << ESPI_RPMC_SUPPORT2_RPMC_OP1_4_SHIFT)) & ESPI_RPMC_SUPPORT2_RPMC_OP1_4_MASK)
/*! @} */

/*! @name WIREIN_GPIO - WIREIN_GPIO */
/*! @{ */

#define ESPI_WIREIN_GPIO_LEVEL_MASK              (0xFU)
#define ESPI_WIREIN_GPIO_LEVEL_SHIFT             (0U)
/*! LEVEL - Level
 *  0b0000..Low
 *  0b0001..High
 */
#define ESPI_WIREIN_GPIO_LEVEL(x)                (((uint32_t)(((uint32_t)(x)) << ESPI_WIREIN_GPIO_LEVEL_SHIFT)) & ESPI_WIREIN_GPIO_LEVEL_MASK)

#define ESPI_WIREIN_GPIO_VALID_MASK              (0xF0U)
#define ESPI_WIREIN_GPIO_VALID_SHIFT             (4U)
/*! VALID - Valid
 *  0b0000..Not valid
 *  0b0001..Valid
 */
#define ESPI_WIREIN_GPIO_VALID(x)                (((uint32_t)(((uint32_t)(x)) << ESPI_WIREIN_GPIO_VALID_SHIFT)) & ESPI_WIREIN_GPIO_VALID_MASK)

#define ESPI_WIREIN_GPIO_INDEX_MASK              (0xFF00U)
#define ESPI_WIREIN_GPIO_INDEX_SHIFT             (8U)
/*! INDEX - Index */
#define ESPI_WIREIN_GPIO_INDEX(x)                (((uint32_t)(((uint32_t)(x)) << ESPI_WIREIN_GPIO_INDEX_SHIFT)) & ESPI_WIREIN_GPIO_INDEX_MASK)
/*! @} */

/*! @name WIREOUT_GPIO - WIREOUT_GPIO */
/*! @{ */

