zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_ESPI.h
#define ESPI_WIREOUT_GPIO_LEVEL_MASK             (0xFU)
#define ESPI_WIREOUT_GPIO_LEVEL_SHIFT            (0U)
/*! LEVEL - Level
 *  0b0000..Low
 *  0b0001..High
 */
#define ESPI_WIREOUT_GPIO_LEVEL(x)               (((uint32_t)(((uint32_t)(x)) << ESPI_WIREOUT_GPIO_LEVEL_SHIFT)) & ESPI_WIREOUT_GPIO_LEVEL_MASK)

#define ESPI_WIREOUT_GPIO_VALID_MASK             (0xF0U)
#define ESPI_WIREOUT_GPIO_VALID_SHIFT            (4U)
/*! VALID - Valid
 *  0b0000..Not valid
 *  0b0001..Valid
 */
#define ESPI_WIREOUT_GPIO_VALID(x)               (((uint32_t)(((uint32_t)(x)) << ESPI_WIREOUT_GPIO_VALID_SHIFT)) & ESPI_WIREOUT_GPIO_VALID_MASK)

#define ESPI_WIREOUT_GPIO_INDEX_MASK             (0xFF00U)
#define ESPI_WIREOUT_GPIO_INDEX_SHIFT            (8U)
/*! INDEX - Index */
#define ESPI_WIREOUT_GPIO_INDEX(x)               (((uint32_t)(((uint32_t)(x)) << ESPI_WIREOUT_GPIO_INDEX_SHIFT)) & ESPI_WIREOUT_GPIO_INDEX_MASK)
/*! @} */

/*! @name CFG - Port Configuration */
/*! @{ */

#define ESPI_CFG_TYPE_MASK                       (0xFU)
#define ESPI_CFG_TYPE_SHIFT                      (0U)
/*! TYPE - Interaction Type between Port and Host
 *  0b0000..Unconfigured (reset condition)
 *  0b0001..ACPI style Endpoint
 *  0b0010..ACPI style index-and-data. Index and data byte locations. Index gives offset into implied space. Uses registers for data and index.
 *  0b0011..Reserved
 *  0b0100..Bus Master Memory Single
 *  0b0101..Bus Master Flash Single
 *  0b0110..Reserved
 *  0b0111..Reserved
 *  0b1000..Mailbox Shared
 *  0b1001..Mailbox Single
 *  0b1010..Mailbox Split
 *  0b1011..Mailbox OOB Split
 *  0b1100..Mailbox OEM
 *  0b1101..Reserved
 *  0b1110..Reserved
 *  0b1111..Reserved
 */
#define ESPI_CFG_TYPE(x)                         (((uint32_t)(((uint32_t)(x)) << ESPI_CFG_TYPE_SHIFT)) & ESPI_CFG_TYPE_MASK)

#define ESPI_CFG_DIRECTION_MASK                  (0x60U)
#define ESPI_CFG_DIRECTION_SHIFT                 (5U)
/*! DIRECTION - Port Direction
 *  0b00..Endpoint or index-and-data: bidirectional (normal). Mailbox Single: unenforced. Mailbox Split or Mailbox Shared: bidirectional.
 *  0b01..Endpoint or index-and-data: ignore read. Mailbox Single: write only. Mailbox Split or Mailbox Shared: ignore read.
 *  0b10..Endpoint or index-and-data: ignore write. Mailbox Single: read only. Mailbox Split or Mailbox Shared: ignore write.
 *  0b11..Endpoint or index-and-data: Ignore both. Mailbox Single: ignore both. Mailbox Split or Mailbox Shared: ignore both.
 */
#define ESPI_CFG_DIRECTION(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_CFG_DIRECTION_SHIFT)) & ESPI_CFG_DIRECTION_MASK)

#define ESPI_CFG_MBINTALL_MASK                   (0x80U)
#define ESPI_CFG_MBINTALL_SHIFT                  (7U)
/*! MBINTALL - Mailbox: map interrupt */
#define ESPI_CFG_MBINTALL(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_CFG_MBINTALL_SHIFT)) & ESPI_CFG_MBINTALL_MASK)

#define ESPI_CFG_STALLRD_MASK                    (0x100U)
#define ESPI_CFG_STALLRD_SHIFT                   (8U)
/*! STALLRD - Stall on any read */
#define ESPI_CFG_STALLRD(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_CFG_STALLRD_SHIFT)) & ESPI_CFG_STALLRD_MASK)

#define ESPI_CFG_STALLWR_MASK                    (0x200U)
#define ESPI_CFG_STALLWR_SHIFT                   (9U)
/*! STALLWR - Stall on write */
#define ESPI_CFG_STALLWR(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_CFG_STALLWR_SHIFT)) & ESPI_CFG_STALLWR_MASK)

#define ESPI_CFG_ERRORIGN_MASK                   (0x400U)
#define ESPI_CFG_ERRORIGN_SHIFT                  (10U)
/*! ERRORIGN - Error Origin
 *  0b0..The host receives an error when trying to perform a read or write that is blocked by PnCFG[DIRECTION].
 *  0b1..Ignored silently. Reads return FFh for each byte if ignored (host property). In either case,
 *       PnSTAT[INTERR] bit becomes 1, causing an interrupt if masked for it.
 */
#define ESPI_CFG_ERRORIGN(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_CFG_ERRORIGN_SHIFT)) & ESPI_CFG_ERRORIGN_MASK)
/*! @} */

/* The count of ESPI_CFG */
#define ESPI_CFG_COUNT                           (5U)

/*! @name STAT - Port Status */
/*! @{ */

#define ESPI_STAT_RDSTAT_MASK                    (0x3U)
#define ESPI_STAT_RDSTAT_SHIFT                   (0U)
/*! RDSTAT - Host Read Data Status
 *  0b00..Endpoint or index-and-data: Empty. Mailbox: Empty (host read to end). Master/Flash: No requests.
 *  0b01..Endpoint or index-and-data: Data waiting from MCU. Mailbox: Started (by MCU). Master/Flash: Started.
 *        From-host: goes to Pending next. To-host: goes to Complete next. SAF: host made request: Started.
 *  0b10..Mailbox: Complete (by MCU). Master/Flash: Complete. SAF: Complete.
 *  0b11..Mailbox: Partially read (by host). Master/Flash: From-host only, Pending (request made); goes to
 *        Complete next. SAF: MCU has setup completion.
 */
#define ESPI_STAT_RDSTAT(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_RDSTAT_SHIFT)) & ESPI_STAT_RDSTAT_MASK)

#define ESPI_STAT_WRSTAT_MASK                    (0xCU)
#define ESPI_STAT_WRSTAT_SHIFT                   (2U)
/*! WRSTAT - Status of Host Writes
 *  0b00..Endpoint: Empty. Index-and-data: Empty. Mailbox: Empty. Master/flash: Not last request.
 *  0b01..Endpoint: data waiting from host. Index-and-data: data waiting from host (index may have been written
 *        before). Mailbox: Started (by host). Master/flash: last request from-host/read-flash (writes to MCU). SAF:
 *        Request from master was or is Flash Read.
 *  0b10..Endpoint: Empty, but last was CMD. Index-and-data: wrote index. Mailbox: complete/last (host to end).
 *        Master/flash: last request to-host/write-flash (read from MCU). SAF: Request from Master was or is Flash
 *        Write.
 *  0b11..Endpoint: CMD waiting from host. Index-and-data: Wrote Data then Index. Mailbox: Partially read (by
 *        MCU). Flash: Last Requested Erase. SAF: Request from Master was or is Flash Erase.
 */
#define ESPI_STAT_WRSTAT(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_WRSTAT_SHIFT)) & ESPI_STAT_WRSTAT_MASK)

#define ESPI_STAT_INTERR_MASK                    (0x100U)
#define ESPI_STAT_INTERR_SHIFT                   (8U)
/*! INTERR - Interrupt Caused by Error */
#define ESPI_STAT_INTERR(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_INTERR_SHIFT)) & ESPI_STAT_INTERR_MASK)

