zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_ESPI.h
#define ESPI_STAT_INTRD_MASK                     (0x200U)
#define ESPI_STAT_INTRD_SHIFT                    (9U)
/*! INTRD - Interrupt Caused by Read */
#define ESPI_STAT_INTRD(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_INTRD_SHIFT)) & ESPI_STAT_INTRD_MASK)

#define ESPI_STAT_INTWR_MASK                     (0x400U)
#define ESPI_STAT_INTWR_SHIFT                    (10U)
/*! INTWR - Interrupt Caused by Write */
#define ESPI_STAT_INTWR(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_INTWR_SHIFT)) & ESPI_STAT_INTWR_MASK)

#define ESPI_STAT_INTSPC0_MASK                   (0x800U)
#define ESPI_STAT_INTSPC0_SHIFT                  (11U)
/*! INTSPC0 - SPC0 Interrupt */
#define ESPI_STAT_INTSPC0(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_INTSPC0_SHIFT)) & ESPI_STAT_INTSPC0_MASK)

#define ESPI_STAT_INTSPC1_MASK                   (0x1000U)
#define ESPI_STAT_INTSPC1_SHIFT                  (12U)
/*! INTSPC1 - SPC1 Interrupt */
#define ESPI_STAT_INTSPC1(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_INTSPC1_SHIFT)) & ESPI_STAT_INTSPC1_MASK)

#define ESPI_STAT_INTSPC2_MASK                   (0x2000U)
#define ESPI_STAT_INTSPC2_SHIFT                  (13U)
/*! INTSPC2 - SPC2 Interrupt */
#define ESPI_STAT_INTSPC2(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_INTSPC2_SHIFT)) & ESPI_STAT_INTSPC2_MASK)

#define ESPI_STAT_INSTSPC3_MASK                  (0x4000U)
#define ESPI_STAT_INSTSPC3_SHIFT                 (14U)
/*! INSTSPC3 - SPC3 Interrupt */
#define ESPI_STAT_INSTSPC3(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_INSTSPC3_SHIFT)) & ESPI_STAT_INSTSPC3_MASK)

#define ESPI_STAT_ERR0_MASK                      (0x10000U)
#define ESPI_STAT_ERR0_SHIFT                     (16U)
/*! ERR0 - Error 0 */
#define ESPI_STAT_ERR0(x)                        (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_ERR0_SHIFT)) & ESPI_STAT_ERR0_MASK)

#define ESPI_STAT_ERR1_MASK                      (0x20000U)
#define ESPI_STAT_ERR1_SHIFT                     (17U)
/*! ERR1 - Error 1 */
#define ESPI_STAT_ERR1(x)                        (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_ERR1_SHIFT)) & ESPI_STAT_ERR1_MASK)

#define ESPI_STAT_ERR2_MASK                      (0x40000U)
#define ESPI_STAT_ERR2_SHIFT                     (18U)
/*! ERR2 - Error 2 */
#define ESPI_STAT_ERR2(x)                        (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_ERR2_SHIFT)) & ESPI_STAT_ERR2_MASK)

#define ESPI_STAT_ERR3_MASK                      (0x80000U)
#define ESPI_STAT_ERR3_SHIFT                     (19U)
/*! ERR3 - Error 3 */
#define ESPI_STAT_ERR3(x)                        (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_ERR3_SHIFT)) & ESPI_STAT_ERR3_MASK)

#define ESPI_STAT_RPMC_1_OR_2_MASK               (0x100000U)
#define ESPI_STAT_RPMC_1_OR_2_SHIFT              (20U)
/*! RPMC_1_OR_2 - RPMC 1 or 2
 *  0b0..RPMC operation 1 has been chosen
 *  0b1..RPMC operation 2 has been chosen
 */
#define ESPI_STAT_RPMC_1_OR_2(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_RPMC_1_OR_2_SHIFT)) & ESPI_STAT_RPMC_1_OR_2_MASK)

#define ESPI_STAT_RPMC_FLASH_DEVICE_MASK         (0x600000U)
#define ESPI_STAT_RPMC_FLASH_DEVICE_SHIFT        (21U)
/*! RPMC_FLASH_DEVICE - RPMC Flash Device
 *  0b00..First device
 *  0b01..Second device
 *  0b10..Third device
 *  0b11..Fourth device
 */
#define ESPI_STAT_RPMC_FLASH_DEVICE(x)           (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_RPMC_FLASH_DEVICE_SHIFT)) & ESPI_STAT_RPMC_FLASH_DEVICE_MASK)
/*! @} */

/* The count of ESPI_STAT */
#define ESPI_STAT_COUNT                          (5U)

/*! @name IRULESTAT - Set Interrupt Rules and User Status */
/*! @{ */

#define ESPI_IRULESTAT_USTAT_MASK                (0x1FU)
#define ESPI_IRULESTAT_USTAT_SHIFT               (0U)
/*! USTAT - User-Defined Status Bits */
#define ESPI_IRULESTAT_USTAT(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_IRULESTAT_USTAT_SHIFT)) & ESPI_IRULESTAT_USTAT_MASK)

#define ESPI_IRULESTAT_INTERR_MASK               (0x100U)
#define ESPI_IRULESTAT_INTERR_SHIFT              (8U)
/*! INTERR - Interrupt If Error Detected */
#define ESPI_IRULESTAT_INTERR(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_IRULESTAT_INTERR_SHIFT)) & ESPI_IRULESTAT_INTERR_MASK)

#define ESPI_IRULESTAT_INTRD_MASK                (0x200U)
#define ESPI_IRULESTAT_INTRD_SHIFT               (9U)
/*! INTRD - Interrupt If Read or First Read or Bus Master Started */
#define ESPI_IRULESTAT_INTRD(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_IRULESTAT_INTRD_SHIFT)) & ESPI_IRULESTAT_INTRD_MASK)

#define ESPI_IRULESTAT_INTWR_MASK                (0x400U)
#define ESPI_IRULESTAT_INTWR_SHIFT               (10U)
/*! INTWR - Interrupt If Write or First Write or Bus Master Finished */
#define ESPI_IRULESTAT_INTWR(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_IRULESTAT_INTWR_SHIFT)) & ESPI_IRULESTAT_INTWR_MASK)

#define ESPI_IRULESTAT_INTSPC_MASK               (0x7800U)
#define ESPI_IRULESTAT_INTSPC_SHIFT              (11U)
/*! INTSPC - Select Interrupts for PnSTAT[INTSPC0] through PnSTAT[INSTSPC3] */
#define ESPI_IRULESTAT_INTSPC(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_IRULESTAT_INTSPC_SHIFT)) & ESPI_IRULESTAT_INTSPC_MASK)

#define ESPI_IRULESTAT_SSTCL_MASK                (0xF0000U)
#define ESPI_IRULESTAT_SSTCL_SHIFT               (16U)
/*! SSTCL - Status Set and Clear */
#define ESPI_IRULESTAT_SSTCL(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_IRULESTAT_SSTCL_SHIFT)) & ESPI_IRULESTAT_SSTCL_MASK)

#define ESPI_IRULESTAT_SRST_MASK                 (0x100000U)
#define ESPI_IRULESTAT_SRST_SHIFT                (20U)
/*! SRST - Reset PnSTAT[RDSTAT] and PnSTAT[WRSTAT] */
#define ESPI_IRULESTAT_SRST(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_IRULESTAT_SRST_SHIFT)) & ESPI_IRULESTAT_SRST_MASK)

#define ESPI_IRULESTAT_FLASH_COMPLETION_TYPE_MASK (0x600000U)
#define ESPI_IRULESTAT_FLASH_COMPLETION_TYPE_SHIFT (21U)
/*! FLASH_COMPLETION_TYPE - Flash Completion Type
 *  0b00..Indicates the middle completion of a split completion sequence
 *  0b01..Indicates the first completion of a split completion sequence
 *  0b10..Indicates the last completion of a split completion sequence
 *  0b11..Indicates the only completion for a split transaction.
 */
#define ESPI_IRULESTAT_FLASH_COMPLETION_TYPE(x)  (((uint32_t)(((uint32_t)(x)) << ESPI_IRULESTAT_FLASH_COMPLETION_TYPE_SHIFT)) & ESPI_IRULESTAT_FLASH_COMPLETION_TYPE_MASK)

#define ESPI_IRULESTAT_CPU_TAG_MASK              (0x7800000U)
#define ESPI_IRULESTAT_CPU_TAG_SHIFT             (23U)
/*! CPU_TAG - CPU Tag */
#define ESPI_IRULESTAT_CPU_TAG(x)                (((uint32_t)(((uint32_t)(x)) << ESPI_IRULESTAT_CPU_TAG_SHIFT)) & ESPI_IRULESTAT_CPU_TAG_MASK)
/*! @} */

/* The count of ESPI_IRULESTAT */
#define ESPI_IRULESTAT_COUNT                     (5U)

/*! @name ADDR - Port Address */
/*! @{ */

#define ESPI_ADDR_OFF_MASK                       (0xFFFFU)
#define ESPI_ADDR_OFF_SHIFT                      (0U)
/*! OFF - Offset */
#define ESPI_ADDR_OFF(x)                         (((uint32_t)(((uint32_t)(x)) << ESPI_ADDR_OFF_SHIFT)) & ESPI_ADDR_OFF_MASK)

#define ESPI_ADDR_BASE_ASZ_MASK                  (0x30000U)
#define ESPI_ADDR_BASE_ASZ_SHIFT                 (16U)
/*! BASE_ASZ - The meaning is dependent on type of port:
 *  0b00..Offset from 0 in host memory or I/O space.
 *  0b01..Uses BASE0 offset in host memory
 *  0b10..Uses BASE1 offset in host memory
 *  0b11..Reserved
 */
#define ESPI_ADDR_BASE_ASZ(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_ADDR_BASE_ASZ_SHIFT)) & ESPI_ADDR_BASE_ASZ_MASK)

#define ESPI_ADDR_IDXOFF_MASK                    (0xF000000U)
#define ESPI_ADDR_IDXOFF_SHIFT                   (24U)
/*! IDXOFF - Index Offset */
#define ESPI_ADDR_IDXOFF(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_ADDR_IDXOFF_SHIFT)) & ESPI_ADDR_IDXOFF_MASK)

#define ESPI_ADDR_IDX1ST_MASK                    (0x10000000U)
#define ESPI_ADDR_IDX1ST_SHIFT                   (28U)
/*! IDX1ST
 *  0b0..Index is higher address than data (for example, data at OFF, index at OFF+IDXOFF)
 *  0b1..Index is lower address than data (for example, index at OFF, data at OFF+IDXOFF)
 */
#define ESPI_ADDR_IDX1ST(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_ADDR_IDX1ST_SHIFT)) & ESPI_ADDR_IDX1ST_MASK)
/*! @} */

/* The count of ESPI_ADDR */
#define ESPI_ADDR_COUNT                          (5U)

/*! @name OMFLEN - Port OOB, Mastering, and Flash Length */
/*! @{ */

#define ESPI_OMFLEN_LEN_MASK                     (0x7FU)
#define ESPI_OMFLEN_LEN_SHIFT                    (0U)
/*! LEN - Length in Bytes */
#define ESPI_OMFLEN_LEN(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_OMFLEN_LEN_SHIFT)) & ESPI_OMFLEN_LEN_MASK)

#define ESPI_OMFLEN_TRANS_MASK                   (0x3000U)
#define ESPI_OMFLEN_TRANS_SHIFT                  (12U)
/*! TRANS - Transfer Request
 *  0b00..OOB: to host; Master: to host 32 (host reads with 32-bit address); SAF: Completion fail
 *  0b01..Master: to host 64 (host reads w/64-bit address); MAF: read flash (location in RAM); SAF: completion with data
 *  0b10..Master: from host 32 (host writes w/32-bit address); MAF: write flash (location in RAM); SAF: completion with no data
 *  0b11..Master: from host 64 (host writes w/64-bit address); MAF: erase flash (sector in RAM)
 */
#define ESPI_OMFLEN_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_OMFLEN_TRANS_SHIFT)) & ESPI_OMFLEN_TRANS_MASK)
/*! @} */

/* The count of ESPI_OMFLEN */
#define ESPI_OMFLEN_COUNT                        (5U)

