zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_ESPI.h
/*! @name DATAIN - Port Data Input */
/*! @{ */

#define ESPI_DATAIN_DATA_LEN_MASK                (0xFFU)
#define ESPI_DATAIN_DATA_LEN_SHIFT               (0U)
/*! DATA_LEN - Data Length */
#define ESPI_DATAIN_DATA_LEN(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_DATAIN_DATA_LEN_SHIFT)) & ESPI_DATAIN_DATA_LEN_MASK)

#define ESPI_DATAIN_DIR_MASK                     (0x100U)
#define ESPI_DATAIN_DIR_SHIFT                    (8U)
/*! DIR - Direction of last access
 *  0b0..Read by host
 *  0b1..Write by host
 */
#define ESPI_DATAIN_DIR(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_DATAIN_DIR_SHIFT)) & ESPI_DATAIN_DIR_MASK)

#define ESPI_DATAIN_IDX_MASK                     (0x3FF0000U)
#define ESPI_DATAIN_IDX_SHIFT                    (16U)
/*! IDX - Index of Last Access */
#define ESPI_DATAIN_IDX(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_DATAIN_IDX_SHIFT)) & ESPI_DATAIN_IDX_MASK)
/*! @} */

/* The count of ESPI_DATAIN */
#define ESPI_DATAIN_COUNT                        (5U)

/*! @name DATAOUT - Port Data Out */
/*! @{ */

#define ESPI_DATAOUT_DATA_MASK                   (0xFFU)
#define ESPI_DATAOUT_DATA_SHIFT                  (0U)
/*! DATA - Data to Send to Host */
#define ESPI_DATAOUT_DATA(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_DATAOUT_DATA_SHIFT)) & ESPI_DATAOUT_DATA_MASK)
/*! @} */

/* The count of ESPI_DATAOUT */
#define ESPI_DATAOUT_COUNT                       (5U)

/*! @name RAMUSE - Port RAM Use */
/*! @{ */

#define ESPI_RAMUSE_OFF_MASK                     (0xFFFU)
#define ESPI_RAMUSE_OFF_SHIFT                    (0U)
/*! OFF - Offset into RAM */
#define ESPI_RAMUSE_OFF(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_RAMUSE_OFF_SHIFT)) & ESPI_RAMUSE_OFF_MASK)

#define ESPI_RAMUSE_LEN_MASK                     (0x70000U)
#define ESPI_RAMUSE_LEN_SHIFT                    (16U)
/*! LEN - Length */
#define ESPI_RAMUSE_LEN(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_RAMUSE_LEN_SHIFT)) & ESPI_RAMUSE_LEN_MASK)
/*! @} */

/* The count of ESPI_RAMUSE */
#define ESPI_RAMUSE_COUNT                        (5U)


/*!
 * @}
 */ /* end of group ESPI_Register_Masks */


/*!
 * @}
 */ /* end of group ESPI_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_ESPI_H_ */

